{
    "01-test": {
        "relativePath": "01-test",
        "hash": "270de012d744dda1329a2a325b139c1796a70d3478b2b97881ac1e5fc7b6d48e",
        "summary": "In this quick and straightforward blog post, I'm simply exploring the functionality of the `related-posts` script. Through the nature of testing and example, we're investigating how this tool operates. The post may not offer in-depth insight or instructions, but it serves as a vital stage in improving and adjusting the tool for optimal use. This post you're currently reading is essentially a placeholder, a tool used as part of an ongoing conversation with the script. Through this process, we can better understand and perfect the `related-posts` script. Thank you for accompanying me on this journey of discovery and improvement.",
        "similarities": [
            {
                "relativePath": "02-synthesisers",
                "permalink": "synthesisers",
                "date": "2023-02-01",
                "title": "Synthesisers",
                "excerpt": "A list of synthesisers.",
                "summary": [
                    "This is similar to what you've just read because it's a journey of exploration and understanding focused on the attributes of different analogue synthesisers, similar to how the first post was a process of understanding and improving the `related-posts` script."
                ],
                "score": 0.2850773993253203
            },
            {
                "relativePath": "04-future-music",
                "date": "2022-01-25",
                "title": "The Future of Music: Predictions and Trends",
                "excerpt": false,
                "summary": [
                    "This is similar to what you've just read because it continues the theme of exploration and discovery, but this time in the context of future music trends and technology."
                ],
                "score": 0.28499477198854833
            }
        ]
    },
    "02-synthesisers": {
        "relativePath": "02-synthesisers",
        "hash": "5c7be3d856050bf1a0ba831d7c261f4d4eb9e05bdce370f6c2908a2461017349",
        "summary": "This blog post shares an engaging write-up on some prime models of monophonic analogue synthesisers that every music enthusiast should know about. We delve into details communicating features of each, all of which share common elements including two oscillators, a filter, two envelopes, an LFO, a sequencer, and a delay effect. \n\nThe first one discussed is the Korg MS-20, followed by two models from Moog, namely Sub 37 and Sub Phatty. We also look at the Moog Grandmother's specifications in this lineup. Beyond Moog, we take a brief look at another standout monophonic analogue synthesiser, Prophet 5 before rounding up this list with details about Fairlight CMI. Irrespective of your experience with music, these synthesizers promised to keep you engaged with their top-notch features.",
        "similarities": [
            {
                "relativePath": "03-music",
                "date": "2022-01-01",
                "title": "The Evolution of Music: The Role of Synthesizers",
                "excerpt": false,
                "summary": [
                    "\"This is similar to what you've just read because the second post provides an historical and cultural context to the use of synthesizers in music, deepening your understanding of the specific models previously discussed.\""
                ],
                "score": 0.5725643485181556
            },
            {
                "relativePath": "04-future-music",
                "date": "2022-01-25",
                "title": "The Future of Music: Predictions and Trends",
                "excerpt": false,
                "summary": [
                    "This is similar to what you've just read because it continues the conversation on music technology and synthesizers, shifting focus to future trends and advancements."
                ],
                "score": 0.47996432030108066
            }
        ]
    },
    "03-music": {
        "relativePath": "03-music",
        "hash": "4a68fab08e3487b3a7407420bc0aa84c11b0491b01ea9c9b73d164c9025893d8",
        "summary": "Delving into the heart of musical innovation, the role of synthesizers cannot be overstated. They've indelibly shaped the sound of countless genres, marking their influence from the psychedelic tunes of the 60s to the pulsating electronic beats of the 21st century. \n\nSynthesizers found their origin in the early 1960s when Robert Moog crafted the first commercially available synthesizer, the Moog. Motivated by the desire to invent sounds not possible by traditional instruments, Moog's creation captured the fascination of musicians and listeners alike, giving birth to a plethora of unheard and extraordinary sounds.\n\nIn the 80s, electronic music emerged, and the synthesizer was the centrifugal force behind it. Synths imprinted their mark on bands like Kraftwerk and Depeche Mode, creating a novel kind of music, simultaneously futuristic and reminiscent, epitomizing the digital age and the synthesis of technology and art.\n\nFast-forward to today, synthesizers, specifically software synthesizers or softsynths, have become widely accessible due to digital advancements, enabling anyone with a computer to produce electronic music. Progress in technology did not wither the initially set goals; rather it fortified them - to devise new, thrilling sounds.\n\nIn conclusion, the synthesizer, in its continuous evolution, has revolutionized the music world like no other, enabling artists to wander in unexplored sonic landscapes. Looking ahead, one can eagerly anticipate the groundbreaking innovation synthesizers will usher into the music scene.\n",
        "similarities": [
            {
                "relativePath": "04-future-music",
                "date": "2022-01-25",
                "title": "The Future of Music: Predictions and Trends",
                "excerpt": false,
                "summary": [
                    "This is similar to what you've just read because it continues the exploration of the influence of technology, specifically synthesizers, on the future trends and innovations in the music industry."
                ],
                "score": 0.6704849830363806
            },
            {
                "relativePath": "02-synthesisers",
                "permalink": "synthesisers",
                "date": "2023-02-01",
                "title": "Synthesisers",
                "excerpt": "A list of synthesisers.",
                "summary": [
                    "This is similar to what you've just read because it expands upon the influence of synthesizers by offering a detailed examination of specific models, including one from Robert Moog's company, which was mentioned in the initial post as a pioneer in the field."
                ],
                "score": 0.5725643485181556
            }
        ]
    },
    "04-future-music": {
        "relativePath": "04-future-music",
        "hash": "69930a3b72416d1c387b3f988da1f6cc7e7d4b2fc4e544c53073077c57e3d461",
        "summary": "In this blog post, we're setting our sights ahead, to the future of music. We'll embark on an exploration of upcoming trends, loaded with predictions that might just make you eager for what's to come. Every note will be analysed; from the way technology is increasingly changing the way we play and produce music, to breakthroughs in synthesizers shaping the industry. Tune in, and let's dive into the sonic world of tomorrow.",
        "similarities": [
            {
                "relativePath": "03-music",
                "date": "2022-01-01",
                "title": "The Evolution of Music: The Role of Synthesizers",
                "excerpt": false,
                "summary": [
                    "\"This is similar to what you've just read because it delves deeper into the history and evolution of synthesizers, a key topic discussed in the first post, outlining their monumental influence on music and looking ahead to their future impact.\""
                ],
                "score": 0.6704849830363806
            },
            {
                "relativePath": "08-future-of-rugby",
                "date": "2022-01-25",
                "title": "The Future of Rugby Union: Predictions and Trends",
                "excerpt": false,
                "summary": [
                    "This is similar to what you've just read because it also delves into predictions about the future, this time concerning Rugby Union, and explores how technology is revolutionizing another area of interest."
                ],
                "score": 0.6234610631875318
            }
        ]
    },
    "05-understanding-rugby": {
        "relativePath": "05-understanding-rugby",
        "hash": "30176b716b8be309119855030a292a5960b939d8713e3b710f91f6c5807fe34c",
        "summary": "As a way of indulging our passions and exploring the thrilling world of sports, our journey today takes us through the nitty-gritty of Rugby Union. Bestowing upon you a beginner's guide, we delve into the fascinating history of the game, its tremendous influence on the sports industry, and the ways it has morphed over time. We'll be also offering some indispensable tips for those beginners eager to immerse themselves in the fray, providing the essential groundwork for learning and excelling at Rugby Union.",
        "similarities": [
            {
                "relativePath": "06-history-of-rugby",
                "date": "2022-01-15",
                "title": "The History of Rugby Union: A Comprehensive Overview",
                "excerpt": false,
                "summary": [
                    "This is similar to what you've just read because it provides a deeper dive into the fascinating history of Rugby Union, further exploring the sport's evolution and the key figures that shaped it."
                ],
                "score": 0.7850644254667672
            },
            {
                "relativePath": "08-future-of-rugby",
                "date": "2022-01-25",
                "title": "The Future of Rugby Union: Predictions and Trends",
                "excerpt": false,
                "summary": [
                    "This is similar to what you've just read because it continues the exploration of Rugby Union, shifting focus from its history and beginner's guide to future trends and the role of technology in its evolution."
                ],
                "score": 0.6798452766577682
            }
        ]
    },
    "06-history-of-rugby": {
        "relativePath": "06-history-of-rugby",
        "hash": "6faf158073a7295ab82ed61c7699c407dc4a8418fb7ab4a31836c44ba34b36eb",
        "summary": "In today's piece, we're diving headfirst into a resounding tale - the history of Rugby Union. With its roots rooted deeply in our past, we'll glean insights into its fascinating evolution over the seasons. Along this enthralling journey, we'll uncover the pioneering roles key figures played in shaping and refining Rugby Union, crafting it into the adrenaline-fueled spectacle that continues to captivate audiences worldwide. Buckle up and embark on this absorbing exploration of Rugby Union's captivating past.",
        "similarities": [
            {
                "relativePath": "05-understanding-rugby",
                "date": "2022-01-10",
                "title": "Understanding Rugby Union: A Beginner's Guide",
                "excerpt": false,
                "summary": [
                    "This is similar to what you've just read because it continues the theme of Rugby Union's fascinating history, while also adding practical guidance and tips for beginners wanting to learn the game."
                ],
                "score": 0.7850644254667672
            },
            {
                "relativePath": "08-future-of-rugby",
                "date": "2022-01-25",
                "title": "The Future of Rugby Union: Predictions and Trends",
                "excerpt": false,
                "summary": [
                    "This is similar to what you've just read because it continues the story of Rugby Union, now focusing on future predictions and technological advancements, making it a great follow-up for those interested in the evolution and future direction of the sport."
                ],
                "score": 0.698451299549283
            }
        ]
    },
    "07-rugby-tech": {
        "relativePath": "07-rugby-tech",
        "hash": "62d82e75f2dba160ca4b54197e38c7aec837b1563a7b9f66c11acfe5361eb4df",
        "summary": "Today we're stepping into the exciting world of Rugby Union, tracing how this ferocious sport has evolved from humble roots soaked in tradition, to a modern-day spectacle harnessing the power of digital technology. Not only will we look at how the game itself has metamorphosed, we’ll delve deeper and explore the transformative role technology has played behind the scenes in training and performance analysis. Buckle up for a journey moving from the rugged analog past to the revolutionary digital present in Rugby Union.",
        "similarities": [
            {
                "relativePath": "08-future-of-rugby",
                "date": "2022-01-25",
                "title": "The Future of Rugby Union: Predictions and Trends",
                "excerpt": false,
                "summary": [
                    "This is similar to what you've just read because it continues the exploration of Rugby Union, specifically looking toward the future and how advancements in technology may further influence and change the sport."
                ],
                "score": 0.7480317483812966
            },
            {
                "relativePath": "06-history-of-rugby",
                "date": "2022-01-15",
                "title": "The History of Rugby Union: A Comprehensive Overview",
                "excerpt": false,
                "summary": [
                    "This is similar to what you've just read because it also covers the history and evolution of Rugby Union, offering additional insights into the key figures who shaped the sport, which complements the technological aspects discussed previously."
                ],
                "score": 0.6733367417734137
            }
        ]
    },
    "08-future-of-rugby": {
        "relativePath": "08-future-of-rugby",
        "hash": "8c11a05302bb0754fe635a73d9fdf0e7522d7a4a50db18e1b708e1cac9539960",
        "summary": "In this post, we're plunging into the exciting world of Rugby Union, charting its course for the future through predictions and spotting emerging trends. This isn’t just about the game on the pitch - we will be diving into how advancements in technology could further revolutionize rugby, shaping its progression and effect on the sport overall. Buckle up, because rugby's future promises to be a thrilling ride!",
        "similarities": [
            {
                "relativePath": "07-rugby-tech",
                "date": "2022-01-20",
                "title": "Technology in Rugby Union: From Analog to Digital",
                "excerpt": false,
                "summary": [
                    "This is similar to what you've just read because it also explores the impact of technology on Rugby Union, from its traditional roots through to modern advances in training and performance analysis."
                ],
                "score": 0.7480317483812966
            },
            {
                "relativePath": "06-history-of-rugby",
                "date": "2022-01-15",
                "title": "The History of Rugby Union: A Comprehensive Overview",
                "excerpt": false,
                "summary": [
                    "This is similar to what you've just read because both posts delve into the world of Rugby Union, with the first analyzing its future, particularly through technological advancements, and the second exploring its past, the key figures involved, and its evolving game nature."
                ],
                "score": 0.698451299549283
            }
        ]
    }
}