{
    "2013-09-24-bullet-journal-workflow": {
        "relativePath": "2013-09-24-bullet-journal-workflow",
        "hash": "ba46ad3b00200c5be7f01010d19b9b49c9f5f627ba79d54af551bdbdc6a76a8f",
        "summary": "In this post, I share my discovery and experience with the Bullet Journal - an analog to-do list system. Task lists often get lost amongst the waves of daily happenings whether they're physically on paper or digital. After trying out several productivity hacks, I found that the Bullet Journal has been the key to my productivity increase.\n\nThe method is surprisingly straightforward. Developed by Ryder Carrol, it involves splitting the to-do list into three categories - tasks, events and notes - each marked with a different symbol. The real beauty of the system lies in its rollover approach, keeping the list relevant as it moves with you from day-to-day and month-to-month. Each day starts with a fresh list where unchecked tasks from the previous day are either deemed irrelevant or moved to the new list, avoiding old task build-up.\n\nStarting each month, I jot down long-term goals and update them daily. The notebook is indexed in the beginning and pages being numbered as they go supports easy track of these goals. Despite the structure of daily and monthly lists, the system also leaves space for flexibility. More than simply easy to maintain, the Bullet Journal has contributed significantly to my increased productivity by instilling structure in my daily routine and reducing task overlook. Thus, it has proven to be more than just a short-term fix for staying organized.",
        "similarities": [
            {
                "relativePath": "2017-01-20-bullet-journal-revisited",
                "permalink": "/bullet-journal-revisited/",
                "date": "2017-01-20",
                "tags": [
                    "articles",
                    "popular"
                ],
                "categories": [
                    "general",
                    "productivity"
                ],
                "title": "Bullet Journal Revisited",
                "excerpt": "The Bullet Journal is a system for Getting Things Done. One nested pen-and-paper list that gets rewritten every morning.",
                "summary": [
                    "This is similar to what you've just read because it discusses the same Bullet Journal system for increasing productivity, but introduces a new approach by implementing it in a digital format and optimizing it further with task categorization."
                ],
                "score": 0.9470248293457335
            },
            {
                "relativePath": "2020-05-06-bullet-journal-redux",
                "permalink": "/bullet-journal-redux/",
                "date": "2020-05-06",
                "tags": "articles",
                "categories": [
                    "general",
                    "productivity"
                ],
                "title": "Spiraling out of control? Open up the Bullet Journal again",
                "excerpt": "Believe it or not, I've thought of something new to say about Bullet Journalling.",
                "summary": [
                    "This is similar to what you've just read because it continues the exploration of the author's experiences with the Bullet Journal system, specifically discussing its role during periods of stress and change, providing deeper insights into how the journal aids productivity during these challenging times."
                ],
                "score": 0.9005965375789721
            }
        ]
    },
    "2013-09-26-simple-is-hard": {
        "relativePath": "2013-09-26-simple-is-hard",
        "hash": "de30c303d2d61aee3a69c38edea70a3714cab6251554dc5bcbdf3d1c63810b4a",
        "summary": "In this blog post, the key message is the importance and challenge of simplicity in design and how it doesn't equate to being simplistic. There's a balance needed between clearing out distractions and keeping the essence of your product, be it an app, a website, or an idea. The danger of oversimplification is making a product's functionality unclear and confusing with users needing instructions.\n\nThe blog delves into the author's experience with this website, iterating that the main substance of a website is its content, in this case, words. Initially, the designs were elaborate with full-page images and animations. But the author realized the focus should be on the “content delivery system”. The content was most important, regardless of how it's accessed or by whom. From this experience, the author learned to prioritize content and clean, direct message delivery rather than style and aesthetics.\n\nHowever, aesthetics shouldn't be totally disregarded. The post argues that, even though you might be tempted to eliminate web styling altogether, the default styling by most browsers is unattractive and negatively impacts content readability. As the post concludes, there is wisdom one can gain from books, with their focus on efficient design and pleasant reading experience. Simple doesn't mean ugly, and there's beauty to be found in the balance between interaction and aesthetic simplicity.",
        "similarities": [
            {
                "relativePath": "2017-01-15-html-doesnt-need-any-styling",
                "permalink": "/html-doesnt-need-any-styling/",
                "date": "2017-01-15",
                "tags": "articles",
                "categories": [
                    "code"
                ],
                "title": "Well-written HTML doesn't need any styling. Except that it does.",
                "excerpt": "One of the best things about HTML is that it just works. As with much of the web, things only get weird when designers and developers start adding things.",
                "summary": [
                    "\"This is similar to what you've just read because it discusses the balance between simplicity and readability, endorsing minimal styling in HTML for the sake of user comfort without sacrificing the ease of content delivery.\""
                ],
                "score": 0.8546598393544547
            },
            {
                "relativePath": "2018-07-01-writing-well",
                "permalink": "/writing-well/",
                "date": "2018-07-01",
                "tags": [
                    "articles",
                    "featured"
                ],
                "categories": [
                    "code",
                    "career"
                ],
                "title": "Writing well is essential. Try your best to get good at it",
                "excerpt": "I’ve worked hard on my writing style, and continually reap the benefits of having done so.",
                "summary": [
                    "This is similar to what you've just read because it also emphasizes the importance of clarity and simplicity, not in designing a product, but in written communication, particularly in the field of tech."
                ],
                "score": 0.8403003646411643
            }
        ]
    },
    "2014-02-01-futura-for-the-win": {
        "relativePath": "2014-02-01-futura-for-the-win",
        "hash": "92b8d1a53e974b8e729209401e887131a130e1ced9c7495dae1d2497f8b69ec2",
        "summary": "After a lengthy and detail-oriented process, the typeface for this blog was unexpectedly chosen to be Futura. Originally the idea was to have a more ornate serif font, but as the design progressed it became clearer that the site needed a sans serif font to work as a neutral backdrop for the portfolio. Despite initially shying away from the idea, Futura soon revealed itself as the fitting choice. Delving further into the quirks of Futura, from an overly large letter spacing after an apostrophe to the similarity of all apostrophes and quotation marks, the font's authenticity shines through.\n\nIn designing the website, it also became evident that choosing Futura and standing by it despite its imperfections allowed for more focus to be put on the details of the site's design, such as negative space and interaction design elements, as well as the content itself. The designs have seen multiple evolutions and iterations, but the fundamental inclusion of Futura as the chosen typeface remains central and showcases the designer's love of this unique and at times eccentric font. The post ends on a note reflecting its 2014 origin - while Futura is no longer the chosen typeface for the site, its luminous run cannot be forgotten.",
        "similarities": [
            {
                "relativePath": "2017-04-19-comic-sans-april-fool-disaster",
                "permalink": "/comic-sans-april-fool-disaster/",
                "date": "2017-04-19",
                "tags": "articles",
                "categories": [
                    "typography"
                ],
                "title": "I changed my site's font to Comic Sans as an April Fool. It was a disaster.",
                "excerpt": "I often hear that \"good design\" works in all situations, no matter what typeface you wrap it in. The reality is a little more nuanced.",
                "summary": [
                    "This is similar to what you've just read because it also explores how the choice of a particular typeface - in this case, Comic Sans for an April Fool's prank - can significantly impact the overall design, perception, and functionality of a website, just as was discussed with the selection of Futura in the first post."
                ],
                "score": 0.8753413992240249
            },
            {
                "relativePath": "2013-09-26-simple-is-hard",
                "permalink": "/simple-is-hard/",
                "date": "2013-09-26",
                "tags": "articles",
                "categories": [
                    "general"
                ],
                "title": "Simple is hard",
                "excerpt": "How I learnt to focus on substance over style, and began to rethink my relationship with ‘good design’.",
                "summary": [
                    "\"This is similar to what you've just read because both posts delve into the importance of aesthetic simplicity in design, with the first discussing the selection of Futura for its website and the second emphasizing the balance needed between an aesthetically pleasing design and clear, focused content delivery.\""
                ],
                "score": 0.8182546840206064
            }
        ]
    },
    "2014-02-07-fullpage-screenshots-in-firefox": {
        "relativePath": "2014-02-07-fullpage-screenshots-in-firefox",
        "hash": "544216a0089cc88ccc5921ececa9aa034478d66ebdeee3bf67b10738f0ffe051",
        "summary": "If you've also found yourself trying to capture full page screenshots for your portfolio or any other purpose, you may have experienced the frustration of struggling with reloads, bugs, or unrendered fonts when using browser extensions. You might not believe it, but Firefox actually has a native way of taking full page screenshots that requires just one line of code. You will no longer have to deal with painstakingly stitching together multiple screenshots of a webpage.\n\nLet me tell you how it works! Simply navigate to the page you wish to capture, and open up Firefox's Developer Tools command line using `shift f2`. You can also press `fn`, if your keyboard rebinding changes `f2`'s usage. Then, type in `screenshot --fullpage YourFileNameHere` and that's it! You'll have your screenshot, showing not just the visible content but the whole webpage down to its last pixel. If you are in a hurry, you can opt not to include a filename; Firefox will name the image using the current date and time. A small note, you may notice a slight streak of transparency on the right hand side of the screenshot when you view it in Photoshop. But considering the convenience, it's a trivial drawback. Try it out for yourself and you can see the full page screenshots I took using this method over on my portfolio page.",
        "similarities": [
            {
                "relativePath": "2015-05-31-inline-svg-icons",
                "permalink": "/inline-svg-icons/",
                "date": "2015-05-31",
                "tags": "articles",
                "categories": [
                    "code"
                ],
                "title": "Getting started with inline SVG icons",
                "excerpt": "As a typography nerd, using a custom font to serve icons felt really good. However, it turns out inline SVG icons are better in almost every way.",
                "summary": [
                    "This is similar to what you've just read because it's another deep-dive into the technical aspects of web development, this time discussing the transition from using icon fonts to inline SVG icons and how to overcome new challenges this presents, which may also be relevant to you if you are interested in website design or performance optimization."
                ],
                "score": 0.7814269354230291
            },
            {
                "relativePath": "2017-01-15-html-doesnt-need-any-styling",
                "permalink": "/html-doesnt-need-any-styling/",
                "date": "2017-01-15",
                "tags": "articles",
                "categories": [
                    "code"
                ],
                "title": "Well-written HTML doesn't need any styling. Except that it does.",
                "excerpt": "One of the best things about HTML is that it just works. As with much of the web, things only get weird when designers and developers start adding things.",
                "summary": [
                    "This is similar to what you've just read because it explores another aspect of webpage design, focusing on how HTML and CSS can be utilized to enhance readability, which could help you further optimize the display and user experience of your screenshotted pages."
                ],
                "score": 0.7791431061759143
            }
        ]
    },
    "2014-09-09-inspirational-web-people": {
        "relativePath": "2014-09-09-inspirational-web-people",
        "hash": "1ad0aae2559dc46362b3be5c9f78b458aff803377de035dd8133b448f2f58893",
        "summary": "The blog post pays tribute to the inspirational people in the digital-community who have impacted the blogger's career. They've found most of these people through podcasts, blog posts, and tutorials. \n\nThe first, Steve Lovegrove, is described as a patient friend and mentor who encouraged them to start their journey in coding. Chris Coyier and Dave Rupert are credited for their realistic and candid approach to their video tutorials on CSS workings and their entertaining and insightful podcast, \"Shop Talk Show.\" Brad Frost is commended for making it exciting to design for the web, while Mark Brickey, Billy Bauman, and James Flames are applauded for hosting their honest and informative podcast about the business of design, \"Adventures In Design.\"\n\nMike Monteiro is celebrated for his stern but useful advice to designers and Jessica Hische's self-starter attitude and specialization in lettering serve as an inspiration. Trent Walton has set a high standard in blog writing and Ben Schwarz's CSS-only slider tutorial had a big impact on the blogger's workflow. They appreciate Sean Johnson and Liz Elcoate's detailed advice on running a web business in their podcast, \"The Freelance Web.\" Lastly, the blogger's biggest day-to-day inspiration comes from their teammate, Daryll Doyle, with his focus on self-improvement.\n\nThe blogger appreciates the generosity and dedication of these web personalities, thanking them for their valuable contributions to the web industry.",
        "similarities": [
            {
                "relativePath": "2017-05-29-podcasts-recommended-listening",
                "permalink": "/podcasts-recommended-listening/",
                "date": "2017-05-29",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "podcasting"
                ],
                "title": "Recommended Listening: my favourite podcasts",
                "excerpt": "Without any constraints of format or time, the best podcasts get to dive deep into topics that wouldn't otherwise get covered.",
                "summary": [
                    "This is similar to what you've just read because the second post delves into the world of podcasts, and specifically recommends \"Shop Talk Show\", which was also mentioned in the first post, thereby providing further engagement to readers interested in insightful digital content."
                ],
                "score": 0.821068688709775
            },
            {
                "relativePath": "2021-10-05-humility-in-tech",
                "permalink": "/humility-in-tech/",
                "date": "2021-10-05",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "career"
                ],
                "title": "Humility in software development",
                "excerpt": "An idea that has been specifically valuable to me in the context of my career in tech.",
                "summary": [
                    "\"This is similar to what you've just read because it also offers personal insight into values and influencers within the tech world, focusing more on the professional approach and importance of humility in the field.\""
                ],
                "score": 0.8180720272139834
            }
        ]
    },
    "2015-05-31-inline-svg-icons": {
        "relativePath": "2015-05-31-inline-svg-icons",
        "hash": "e1d9e3da95597b9ffad309581fb383bdd6747ad646132d79a52359fd524aaa4c",
        "summary": "In this blog post, the author discusses about his transition from using icon fonts to inline SVG icons. While icon fonts are vector-based, resolution-independent, lightweight and can be easily automated with a task-runner, it is noted that there are a few issues such as unpredictable rendering inconsistencies and failures, and automation hiccups. \n\nThe author suggests that switching to SVGs instead eliminates these issues, but raises the problem of loading a new file for every icon, slowing down website performance. The solution to this is to use SVG sprites where you can combine multiple images into a single SVG file and selectively pull them out using their IDs. This setup does take some initial configuring on a task-runner like Gulp.\n\nThe author also explores using inline SVG in Jekyll and Wordpress, introducing ways to include a SVG sprite in both. While Jekyll allows easy inclusion of the sprite, Wordpress requires a bit of PHP usage. Styling and manipulating SVG icons can be handled well with CSS, despite minor hurdles.\n\nIn the end, the author concludes that SVG sprites have significant advantages and are considerably easier to use and maintain than icon fonts, and can't imagine using an icon font again.\n",
        "similarities": [
            {
                "relativePath": "2017-02-26-inline-svg-icon-sprites",
                "permalink": "/inline-svg-icon-sprites/",
                "date": "2017-02-26",
                "tags": "articles",
                "categories": [
                    "code"
                ],
                "title": "Inline SVG icon sprites are (still) not scary.",
                "excerpt": "One of the best things about HTML is that it just works. As with much of the web, things only get weird when designers and developers start adding things.",
                "summary": [
                    "This is similar to what you've just read because it further elaborates on the implementation and benefits of SVG icon sprites, providing step-by-step instructions for using Gulp to automate the sprite creation process for enhancing website performance – a strategy discussed in the first blog post."
                ],
                "score": 0.9469621901606602
            },
            {
                "relativePath": "2017-02-15-svg-markup",
                "permalink": "/svg-markup/",
                "date": "2017-02-15",
                "tags": [
                    "articles",
                    "popular"
                ],
                "categories": [
                    "code"
                ],
                "title": "Getting to grips with SVG markup",
                "excerpt": "SVGs are complex, for sure, but that very complexity gives them their power. And we don't need to know the intricacies of the co-ordinate system to harness that power.",
                "summary": [
                    "This is similar to what you've just read because it further delves into the intricacies of SVGs, giving a detailed account of their structure, how to manipulate them in HTML and CSS, and the advantages they offer over rasterized images, which complements the technique of switching to SVGs from icon fonts discussed in the first post."
                ],
                "score": 0.8894873376523494
            }
        ]
    },
    "2015-08-05-internet-fridge": {
        "relativePath": "2015-08-05-internet-fridge",
        "hash": "21c4ac69a072600c93205cd7ea1e1e79a5f1ad0b6fdc7bed0350420937c057e9",
        "summary": "While the concept of an internet-connected fridge has been brought up time and again, most of us are yet to have one in our kitchens. But why is that? What are the challenges in bringing this IoT dream into reality and what benefits would it have if it did exist? \n\nAs I discuss in great detail, adding internet to a fridge or any other device isn't particularly beneficial by itself. The true potential of IoT lies in enabling us to access our devices through the internet, rather than simply accessing the internet through our devices. Using sensors, we can monitor when components are about to fail, send a webcam snapshot of the fridge interior to our phone, or even track the state of the food stored within. \n\nEnvisioning this kind of smart fridge is easy, but making it a reality is far more challenging. The long development cycles, infrequent purchase habits, and the fact that white-goods manufacturers are not software companies paints a bleak picture. Creating the necessary user-friendly software is tough while making user-friendly hardware isn’t a walk in the park either – combining the two is a mammoth task. These difficulties, coupled with market resistance to pricier products and the unattractiveness of the business model to the current incumbents, contribute to the slow progression of the Internet Fridge.\n\nSo, are start-ups the answer? They are known for their embrace of innovation and quick iteration cycles, characteristics much needed for this cause. But the complexities and cost-inefficiencies of hardware development can delay growth. What we need is a large, established company that values innovation and design, with a strong foundation in both hardware and software sectors, and the financial capacity for long-term investments.\n\nGiven these challenges, it is unlikely we'll witness the advent of the ideal Internet Fridge soon. Although it is an intriguing proposition, and one that could indeed make our lives more convenient, the journey there is a complex and difficult one yet to be embarked upon.\n",
        "similarities": [
            {
                "relativePath": "2015-12-04-thingmonk-day-two",
                "permalink": "/thingmonk-day-two/",
                "date": "2015-12-04",
                "tags": "articles",
                "categories": [
                    "events"
                ],
                "title": "Notes from ThingMonk: Day Two",
                "excerpt": "The second installment of my notes from the ThinkMonk IoT conference.",
                "summary": [
                    "This is similar to what you've just read because it also discusses IoT technology, including its challenges, potentials, and various applications, which will be of interest given the exploration of IoT in the context of an 'Internet Fridge' in the first post."
                ],
                "score": 0.8147379253328126
            },
            {
                "relativePath": "2015-12-03-thingmonk-day-one",
                "permalink": "/thingmonk-day-one/",
                "date": "2015-12-03",
                "tags": "articles",
                "categories": [
                    "events"
                ],
                "title": "Notes from ThingMonk: Day One",
                "excerpt": "Some of the leading figures in the IoT industry got together to talk shop. Here's what I thought of it all.",
                "summary": [
                    "This is similar to what you've just read because it also discusses the complexities and challenges in the real-world implementation of Internet of Things devices, with emphasis on design, user experience, and data handling, providing a broader perspective on the IoT landscape."
                ],
                "score": 0.8136103856442972
            }
        ]
    },
    "2015-12-04-thingmonk-day-two": {
        "relativePath": "2015-12-04-thingmonk-day-two",
        "hash": "a374be49c42e1444f6f3229a800cbc984625c11be91ed68e3f7207f610252029",
        "summary": "Day two at the ThingMonk IoT conference continued to catalyse ideas and discussions around IoT technology. The day started with Andy Stanford-Clark from IBM introducing the Hy Pi Zero, a Raspberry Pi powered by a hydrogen fuel cell, and offering the Ambient Kettle Project as an example of technology improving communication. Another impressive talk was presented by Tom Raftery from GreenMonk who brought attention to the convergence of IoT and energy, emphasizing the need for predictive maintenance and demand management to address environmental concerns. Jeremiah Stone from GE elaborated on how this heavy-industry company utilises digital potential to save costs while enhancing efficiency.\n\nJames Hodge and Matt Davies from Splunk discussed the potential of data analytics in improving the Build-Measure-Learn cycle. They were followed by Keith O'Byrne from Asavie drawing attention to the cruciality of good connectivity in IoT projects. Tomas Grassl from Redmonk segregated between consumer and business IoT, restating the potential of IoT in revolutionising businesses. Kyle Roche, an AWS representative, showcased IoT technology at various scales, underlining how this technology effectively saves resources. Wrapping up the day, Pat Patterson from SalesForce emphasised the power of demos and affordability of prototyping in promoting IoT technology.\n \nIn summary, ThingMonk 2015 successfully brought together individuals and businesses engaged in a plethora of IoT projects, reaffirming that this digital revolution has indeed begun. Not only did it inspire me to be more involved in IoT side-projects, but embedded the idea that it is increasingly crucial to incorporate IoT concepts into everyday work frameworks.",
        "similarities": [
            {
                "relativePath": "2015-12-03-thingmonk-day-one",
                "permalink": "/thingmonk-day-one/",
                "date": "2015-12-03",
                "tags": "articles",
                "categories": [
                    "events"
                ],
                "title": "Notes from ThingMonk: Day One",
                "excerpt": "Some of the leading figures in the IoT industry got together to talk shop. Here's what I thought of it all.",
                "summary": [
                    "\"This is similar to what you've just read because it continues the discussion on IoT from the ThingMonk conference, focusing on user experience, design, security, and the future of IoT.\""
                ],
                "score": 0.9431052355240525
            },
            {
                "relativePath": "2015-08-05-internet-fridge",
                "permalink": "/internet-fridge/",
                "date": "2015-08-05",
                "tags": "articles",
                "categories": [
                    "general"
                ],
                "title": "Why doesn’t everyone have an Internet Fridge?",
                "excerpt": "An internet-connected fridge is the go-to example when trying to explain the Internet Of Things to lay people. So why don't we have them yet? And do we really want them? Or even need them?",
                "summary": [
                    "\"This is similar to what you've just read because it continues the discussion on real-world applications and the challenges of IoT technology, focusing on the concept of an Internet-connected fridge.\""
                ],
                "score": 0.8147379253328126
            }
        ]
    },
    "2016-01-20-web-apps": {
        "relativePath": "2016-01-20-web-apps",
        "hash": "6122c211de9e7baa0d6cb3c86ab91cb0dd3cc91c225d1005235e732cd9c332f8",
        "summary": "The native app or web app debate is a contentious one, with staunch supporters on both sides. In my opinion, web apps - websites that mimic the behaviors of apps - are a crucial tool a startup can benefit from. To many, the definition of web apps and websites can appear blurred, but I believe their differentiation mostly lies in their usage.\n\nThe popularity of native apps, especially on iPads and iPhones, is often attributed to the poor iOS browsing experience. Native apps also have an advantage as they can access device features more conveniently than a website. However, for startups building their first product, the web is the clear winner when used on an actual computer. \n\nDuring the early stages of a new venture, resources are scarce and teams generally excel in only a few key competences. Hence in these cases, a shared focus is necessary to avoid waste of resources. Building a Minimum Viable Product (MVP) for every available platform would split resources and slow down the process - which can be debilitating when you are trying to develop a product-market fit.\n\nLuckily, this is where web apps shine. The web is versatile and universal, bypassing device compatibility issues that native apps struggle with. From an update perspective, deploying a new update or bugfix is much simpler with web apps. There is no need for outside approval or user download. \n\nLooking ahead, a successful app would want to branch out to multiple platforms. Having a decent Application Programming Interface (API) allows you to plug any front-end into the bulk your app's functionality, saving you the trouble of rebuilding the entire app from scratch. This could be especially simplified if your endpoint prototype is initially web-based. In terms of workforce, hiring developers with experience in web apps is easier due to their prevalence. \n\nIn conclusion, if you are moving towards building an MVP, I'd recommend focusing on creating a web app. It's a time-saving, flexible option that sets you on your path towards success.",
        "similarities": [
            {
                "relativePath": "2013-09-26-simple-is-hard",
                "permalink": "/simple-is-hard/",
                "date": "2013-09-26",
                "tags": "articles",
                "categories": [
                    "general"
                ],
                "title": "Simple is hard",
                "excerpt": "How I learnt to focus on substance over style, and began to rethink my relationship with ‘good design’.",
                "summary": [
                    "This is similar to what you've just read because it further explores the principles of good web design, focusing on the importance of simplicity and balance between aesthetics and functionality, which complements the technical discussion of web apps in the first post."
                ],
                "score": 0.817038006756457
            },
            {
                "relativePath": "2017-05-29-podcasts-recommended-listening",
                "permalink": "/podcasts-recommended-listening/",
                "date": "2017-05-29",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "podcasting"
                ],
                "title": "Recommended Listening: my favourite podcasts",
                "excerpt": "Without any constraints of format or time, the best podcasts get to dive deep into topics that wouldn't otherwise get covered.",
                "summary": [
                    "This is similar to what you've just read because it provides insights into the tech world, specifically around web development and silicon valley, which could be beneficial for startups considering their MVP strategy discussed in the first post."
                ],
                "score": 0.7983451738015729
            }
        ]
    },
    "2016-08-23-your-problem-is-not-your-users-problem": {
        "relativePath": "2016-08-23-your-problem-is-not-your-users-problem",
        "hash": "ea093e74d12497d4a75ec8335289d675c63fa6291f315c6c8d518c362ad88689",
        "summary": "In my latest post, I highlight a worrying trend of organisations shifting their burdens onto their customers. It’s a common phenomenon that results in added complexity for the user. For instance, the seemingly innocuous act of dividing an online form into sections for 'first name' and 'surname', as opposed to one field for the full name, actually makes things easier for developers, not users. \n\nEssentially, there's an inherent complexity in any worthwhile task, and it’s often the developers who decide who shoulders this burden. However, user interface design should prioritise simplicity for users above everything else – especially in e-commerce, where simplicity directly influences conversion rates. Every extra field, button, or decision for the user can potentially reduce conversion rates. Even simple things, like clear directions for input or well-placed placeholder text, can make a significant difference. Therefore, while developers understandably seek ease, they must prioritise user experience and avoid treating aligned coding practices as universal solutions.",
        "similarities": [
            {
                "relativePath": "2013-09-26-simple-is-hard",
                "permalink": "/simple-is-hard/",
                "date": "2013-09-26",
                "tags": "articles",
                "categories": [
                    "general"
                ],
                "title": "Simple is hard",
                "excerpt": "How I learnt to focus on substance over style, and began to rethink my relationship with ‘good design’.",
                "summary": [
                    "This is similar to what you've just read because both posts discuss the critical balance between usability and aesthetics in design, with this post further exploring the challenge of maintaining functionality while reducing complexity."
                ],
                "score": 0.8334793884553628
            },
            {
                "relativePath": "2018-07-01-writing-well",
                "permalink": "/writing-well/",
                "date": "2018-07-01",
                "tags": [
                    "articles",
                    "featured"
                ],
                "categories": [
                    "code",
                    "career"
                ],
                "title": "Writing well is essential. Try your best to get good at it",
                "excerpt": "I’ve worked hard on my writing style, and continually reap the benefits of having done so.",
                "summary": [
                    "\"This is similar to what you've just read because it also emphasizes the importance of clear, user-centered communication, but in relation to developer-client interaction rather than UI design, suggesting that the ways we communicate strongly influence outcomes in other aspects of technology and e-commerce too.\""
                ],
                "score": 0.8160498464072673
            }
        ]
    },
    "2016-09-28-a-good-readme": {
        "relativePath": "2016-09-28-a-good-readme",
        "hash": "332bb19054375a88f496d95f5bf6c191cd464f22ad09e43c23f1eabd19e7a599",
        "summary": "The blog post speaks to the important role that README files play in a coding project. The blogger emphasizes that though languages used for coding may simplify the task at hand, they exist more for the human's understanding than for the computer's. Typing in `for` or `while` is an abstraction from the binary language that computers understand. It's a reminder that code isn't just for the individual developer that writes it, but is also meant to be understood by any other developer that comes across it.\n\nHowever, comprehension isn't just facilitated through the use of these programming languages or even the use of comments in the code. Ultimately, the most important file for the readability and comprehension of a project is the README file. This document, the reader is reminded, won't control routing or manage dependencies or run any code at all. But it is the textual place where one developer tells the other what the project is, what tools were needed in creating it, how it functions, and even suggestions for further development. For any new individual coming to the project, it is their starting point and guides them on their journey through the project. Writing a poor README is akin to not writing anything at all, as it impedes comprehension and successful enactment of the project's goals.",
        "similarities": [
            {
                "relativePath": "2018-07-01-writing-well",
                "permalink": "/writing-well/",
                "date": "2018-07-01",
                "tags": [
                    "articles",
                    "featured"
                ],
                "categories": [
                    "code",
                    "career"
                ],
                "title": "Writing well is essential. Try your best to get good at it",
                "excerpt": "I’ve worked hard on my writing style, and continually reap the benefits of having done so.",
                "summary": [
                    "This is similar to what you've just read because it further emphasizes the importance of clear communication and effective writing in the field of coding, specifically highlighting how the skill of writing can enhance documentation, client interactions, and overall project results, much like the significance of a well-constructed README file in the first post."
                ],
                "score": 0.8304536455263357
            },
            {
                "relativePath": "2017-01-15-html-doesnt-need-any-styling",
                "permalink": "/html-doesnt-need-any-styling/",
                "date": "2017-01-15",
                "tags": "articles",
                "categories": [
                    "code"
                ],
                "title": "Well-written HTML doesn't need any styling. Except that it does.",
                "excerpt": "One of the best things about HTML is that it just works. As with much of the web, things only get weird when designers and developers start adding things.",
                "summary": [
                    "This is similar to what you've just read because it also emphasizes the importance of readability and user comfort in programming, shifting the focus from README files to how HTML and CSS can optimize a webpage's layout for better comprehension."
                ],
                "score": 0.8126413198058101
            }
        ]
    },
    "2017-01-05-calculating-reading-speed": {
        "relativePath": "2017-01-05-calculating-reading-speed",
        "hash": "5d65db08e723ff515877d3fc8a57ac53b0166500d786bd987f530227c6fa4649",
        "summary": "In my pursuit of understanding whether displaying an approximate reading time would affect reader engagement, I've conducted a small experiment. My initial hypothesis was that a reading-time indication would increase click-throughs by providing users useful data. \n\nI found various examples of reading-time-calculation functions. My approach diverged in that I prioritized complete understanding, clarity and separation of concerns, hence, separating calculation logic from display logic. I implemented this concept in the WordPress context, where content-manipulation is for plugins and display is for themes.\n\nFor calculation of reading time, a JavaScript function was used. The process involved counting words and dividing by the reading speed. Displaying time included converting seconds to a minutes-and-seconds format. Here, modular arithmetic helped me find the remaining seconds in a minute. \n\nI wanted to show a more ‘human’ result so I used a dynamic approach to create messages based on how closely the total length was to a rounded minute. Hence, if I ended up with approximately 2 seconds remaining, it would indicate ‘nearly a minute’. Lastly, I made use of Karl Rixon's solution to convert raw integers to strings. \n\nThe final step was to combine everything for my WordPress post content. I’m yet to see the outcome and whether or not this will achieve higher click-through rates is to be determined. Nonetheless, it was a fascinating dive into the problem.\n",
        "similarities": [
            {
                "relativePath": "2022-02-25-wordle-node-script",
                "permalink": "/wordle-node-script/",
                "date": "2022-02-25",
                "tags": [
                    "articles",
                    "featured"
                ],
                "categories": [
                    "code"
                ],
                "title": "Improving my Wordle opening words using simple node scripts",
                "excerpt": "Crafting command-line scripts to calculate the most frequently used letters in Wordle (and finding an optimal sequence of starting words).",
                "summary": [
                    "This is similar to what you've just read because it describes another self-led experiment where the author combined programming, data analysis, and creative problem-solving, this time to optimize the way they played a word game, advancing knowledge in an approachable yet technical way."
                ],
                "score": 0.797173679239104
            },
            {
                "relativePath": "2020-12-30-web-audio-delay",
                "permalink": "/web-audio-delay/",
                "date": "2020-12-30",
                "tags": [
                    "articles",
                    "featured",
                    "intro"
                ],
                "categories": [
                    "audio",
                    "code"
                ],
                "title": "Building a delay effect with the Web Audio API",
                "excerpt": "An introduction to the power of JavaScript's Web Audio API",
                "summary": [
                    "This is similar to what you've just read because it also involves technical problem-solving using JavaScript to create a specific functionality, in this case manipulating browser's audio context to replicate a delay pedal."
                ],
                "score": 0.780369102026233
            }
        ]
    },
    "2017-01-15-html-doesnt-need-any-styling": {
        "relativePath": "2017-01-15-html-doesnt-need-any-styling",
        "hash": "c8c0d3737cb8a95b35c1b27a97f4aa1ec1d7bf36715f4ea11a124da7b7e90a31",
        "summary": "HTML is great because it simply works. Raw HTML can display on every browser and every device. Some bloggers, like developer Dan Luu, take advantage of the simplicity of HTML, refusing to use any style sheets on their blogs. While this may present content in an undistracted way, it has disadvantages. The length of the lines make his articles hard to read. Studies show that there is an upper limit to the line-length that a person can comfortably read in one go. HTML is not mindful of this, so a source of frustration lies in line-lengths that stretch endlessly across widescreen displays. However, adding three lines of CSS to the HTML page solves the problem, regulating the max-width of the text so our eyes can discern where the next line begins. It even solves the width issue on smaller screens, because while we’re setting a max-width, the page will fit to any available space. While presenting content purely in HTML means lesser load on servers, in-lining CSS rules within HTML doesn’t add much load either. It isn’t stylistically “pure\", but it works. Therefore, it isn’t wise to swear by pure HTML without sparing a thought for reader’s comfort and the readability of your webpage.",
        "similarities": [
            {
                "relativePath": "2013-09-26-simple-is-hard",
                "permalink": "/simple-is-hard/",
                "date": "2013-09-26",
                "tags": "articles",
                "categories": [
                    "general"
                ],
                "title": "Simple is hard",
                "excerpt": "How I learnt to focus on substance over style, and began to rethink my relationship with ‘good design’.",
                "summary": [
                    "This is similar to what you've just read because it explores the balance between functionality and aesthetics in web design, emphasizing that while content is key, careful attention needs to be paid to user experience and readability, which resonates with the discussion of line-lengths and the use of CSS in HTML in the first post."
                ],
                "score": 0.8546598393544547
            },
            {
                "relativePath": "2017-02-26-inline-svg-icon-sprites",
                "permalink": "/inline-svg-icon-sprites/",
                "date": "2017-02-26",
                "tags": "articles",
                "categories": [
                    "code"
                ],
                "title": "Inline SVG icon sprites are (still) not scary.",
                "excerpt": "One of the best things about HTML is that it just works. As with much of the web, things only get weird when designers and developers start adding things.",
                "summary": [
                    "This is similar to what you've just read because it also explores how specific web development techniques, in this case SVG sprites, can be used to enhance the user experience on websites, just as the first post examined the benefits of combining HTML with CSS."
                ],
                "score": 0.8214514898616161
            }
        ]
    },
    "2017-01-20-bullet-journal-revisited": {
        "relativePath": "2017-01-20-bullet-journal-revisited",
        "hash": "6b2221d7fce4fbb792e341b934a5a929e0dc910be1742725632c4a9eaed1614a",
        "summary": "In this blog post, I revisit the art of the Bullet Journal - a very effective system I'd found for Getting Things Done. I used it religiously during my time as a freelancer. Since then I find I've been attempting - struggling, really - to manage all the myriad tasks and aspirations I juggle in my everyday life without a clear system. So, I decided to dust off the old Bullet Journal approach and, in doing so, found some new ways of making it work for me.\n\nInstead of using the analogue notebook I had initially, I've transitioned my Bullet Journal to a digital format. I now keep my lists in a series of markdown files saved in a private Dropbox folder. I've adapted the original system to suit my new process. Tasks that are done get deleted, those yet to be done are marked to carry over to the next day. I've kept the key tenets of the Bullet Journal system, but made it simpler and more efficient. I also group my tasks into categories like \"Big Goals\", \"Technologies to learn (and master?)\", \"Dream goals\", and \"Short-term tasks\". The items stay visible and front-and-center. In this way, I find maintaining my Bullet Journal to not only serve as a disciplined task list but also keep my long-term aspirations and wild dreams in sight, which truly boosts my productivity.",
        "similarities": [
            {
                "relativePath": "2013-09-24-bullet-journal-workflow",
                "permalink": "/bullet-journal-workflow/",
                "date": "2013-09-24",
                "tags": "articles",
                "categories": [
                    "general",
                    "productivity"
                ],
                "title": "A bullet-journal workflow",
                "excerpt": "An analogue to-do list system. To-do lists are usually just a short-term fix, but I've found a system that stays relevant.",
                "summary": [
                    "This is similar to what you've just read because it also discusses the effectiveness, adaptability, and productive benefits of using the Bullet Journal system, but in a physical format, which might give you a different perspective."
                ],
                "score": 0.9470248293457335
            },
            {
                "relativePath": "2020-05-06-bullet-journal-redux",
                "permalink": "/bullet-journal-redux/",
                "date": "2020-05-06",
                "tags": "articles",
                "categories": [
                    "general",
                    "productivity"
                ],
                "title": "Spiraling out of control? Open up the Bullet Journal again",
                "excerpt": "Believe it or not, I've thought of something new to say about Bullet Journalling.",
                "summary": [
                    "\"This is similar to what you've just read because it further explores the author's personal experience in using the Bullet Journal as a tool for managing tasks during periods of stress and transition, offering further insights into how it influences his productivity.\""
                ],
                "score": 0.8944423399669991
            }
        ]
    },
    "2017-02-15-svg-markup": {
        "relativePath": "2017-02-15-svg-markup",
        "hash": "9251ce4858ef31fe08601f7a4d6575cc1fa3edf00800334e318ef09e57720851",
        "summary": "SVGs or Scalable Vector Graphics, complex as they are, hold immense power and potential. They can produce sharper and clearer results as compared to rasterized images like PNGs without requiring different files for each size. Using a single SVG file for all image sizes not only reduces HTTP requests but also the total page weight.\n\nThe language of SVGs, derived from XML, is relatively simple to master once you know what tags to look out for. The structure of SVG markup starts with an opening tag (`<svg>`) and ends with a closing tag (`</svg>`), similar to HTML. The main concept is using tags like `<path/>`, `<circle/>`, and `<rect/>` to build shapes within the SVG.\n\nThe SVGs can also be styled using CSS, offering a fine-grained control over individual parts of an icon. This control extends to transitions, animations, and positioning as well, providing an opportunity for developers to get more creative with their designs. Using CSS animations, a simple loading graphic can be transformed into an appealing and interactive design element. Can you imagine such an advantage with just playing around SVGs and CSS? Don't worry, the only limit appears to be the creativity and imagination of the developers who build them.",
        "similarities": [
            {
                "relativePath": "2017-02-26-inline-svg-icon-sprites",
                "permalink": "/inline-svg-icon-sprites/",
                "date": "2017-02-26",
                "tags": "articles",
                "categories": [
                    "code"
                ],
                "title": "Inline SVG icon sprites are (still) not scary.",
                "excerpt": "One of the best things about HTML is that it just works. As with much of the web, things only get weird when designers and developers start adding things.",
                "summary": [
                    "This is similar to what you've just read because it continues the discussion on SVGs, further exploring their use in sprites for better website performance and providing a step-by-step guide on how they can be built and managed, making it a suitable follow-up for those interested in applying SVGs practically."
                ],
                "score": 0.9008468410708951
            },
            {
                "relativePath": "2015-05-31-inline-svg-icons",
                "permalink": "/inline-svg-icons/",
                "date": "2015-05-31",
                "tags": "articles",
                "categories": [
                    "code"
                ],
                "title": "Getting started with inline SVG icons",
                "excerpt": "As a typography nerd, using a custom font to serve icons felt really good. However, it turns out inline SVG icons are better in almost every way.",
                "summary": [
                    "This is similar to what you've just read because it provides a practical perspective on the use of SVGs, discussing the author's personal transition from icon fonts to inline SVGs and offers real-world solutions for web optimisation using SVG sprites, which could interest developers who want to explore more about SVG's advantages and how to improve their website performance."
                ],
                "score": 0.8894873376523494
            }
        ]
    },
    "2017-02-26-inline-svg-icon-sprites": {
        "relativePath": "2017-02-26-inline-svg-icon-sprites",
        "hash": "431bf52c37d7f49984079647ffdce92b1f05a4c7fcf229c95d496c12f865a2a5",
        "summary": "The blog discusses the use and benefits of SVG icon sprites on websites. Using SVG icon sprites, large companies and development communities, like Lonely Planet, GitHub, and CodePen, have reaped benefits due to their ease of use and lesser file sizes in comparison to raster formats (JPG & PNG). The author gives step-by-step instructions of using SVG sprites by group blocking the icon code in one file for later use and referencing it whenever necessary.\n\nThe author goes into detail explaining the process of building SVG sprite using Gulp, a task runner, automating the sprite creation process which can sometimes be tasking for developers. Once configured, new icons can easily be added into the mix by simply running `gulp svg`.\n\nExtra SVG icons can also be easily included by selectively copying the markup from cleaned-up SVG files. The author finally concludes the post by stating the usefulness of using SVG icon sprites in creating a better performance and scalability for the website's icon system. Despite the complexity, maintaining it with a sensible workflow and toolset make SVG icon sprites a preferred choice.",
        "similarities": [
            {
                "relativePath": "2015-05-31-inline-svg-icons",
                "permalink": "/inline-svg-icons/",
                "date": "2015-05-31",
                "tags": "articles",
                "categories": [
                    "code"
                ],
                "title": "Getting started with inline SVG icons",
                "excerpt": "As a typography nerd, using a custom font to serve icons felt really good. However, it turns out inline SVG icons are better in almost every way.",
                "summary": [
                    "This is similar to what you've just read because it provides additional insights on the transition from icon fonts to SVG sprites, adds practical examples on how to use SVG sprites in Jekyll and Wordpress, and reinforces the idea of SVG sprites being advantageous in terms of website performance and ease of maintenance."
                ],
                "score": 0.9469621901606602
            },
            {
                "relativePath": "2017-02-15-svg-markup",
                "permalink": "/svg-markup/",
                "date": "2017-02-15",
                "tags": [
                    "articles",
                    "popular"
                ],
                "categories": [
                    "code"
                ],
                "title": "Getting to grips with SVG markup",
                "excerpt": "SVGs are complex, for sure, but that very complexity gives them their power. And we don't need to know the intricacies of the co-ordinate system to harness that power.",
                "summary": [
                    "This is similar to what you've just read because it further explores the benefits of using SVGs, adds depth to the understanding of SVG markup and emphasizes the potential for creativity and design control using SVGs and CSS, which complements the discussion on SVG icon sprites."
                ],
                "score": 0.9008468410708951
            }
        ]
    },
    "2017-03-22-what-is-a-decibel-anyway": {
        "relativePath": "2017-03-22-what-is-a-decibel-anyway",
        "hash": "67a9ac9116be33255173788ce769e036c500148303b5f6cb7b923f1c0dae2796",
        "summary": "The post provides a comprehensive explanation on the function of decibels in the context of professional audio mixing and sound engineering. It clears up the initial confusion regarding the value \"0\" often used to refer to loudness in some contexts, while at the same time it can mean silence in other instances. It gives an extensive look into what decibels are, highlighting their function as relative units that help express ratios, properly and efficiently communicate very large or tiny differences, and quantify sound intensity and/or pressure. \n\nThe article further delves into specifics by discussing units like dBFS (decibel full scale) which measures sound relative to the maximum possible level that can be produced by audio equipment. In the mixing context, dBFS measures how much sound is produced below the equipment's maximum volume capacity. The author interestingly incorporates their own practical experience in using decibels, giving the discussion a personal touch. The concluding statements are an update offering further insights from fellow professionals responding to the post, which brought up points on how the sound medium and digital versus analogue audio can influence the definition and utilization of decibels.",
        "similarities": [
            {
                "relativePath": "2020-12-30-web-audio-delay",
                "permalink": "/web-audio-delay/",
                "date": "2020-12-30",
                "tags": [
                    "articles",
                    "featured",
                    "intro"
                ],
                "categories": [
                    "audio",
                    "code"
                ],
                "title": "Building a delay effect with the Web Audio API",
                "excerpt": "An introduction to the power of JavaScript's Web Audio API",
                "summary": [
                    "This is similar to what you've just read because it continues to explore audio manipulation, this time delving into the hands-on creation of sound effects through coding and the practical application of sound principles such as feedback and delay."
                ],
                "score": 0.8118183831639654
            },
            {
                "relativePath": "2021-03-31-falling-back-in-love-with-music",
                "permalink": "/falling-back-in-love-with-music/",
                "date": "2021-03-31",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "audio"
                ],
                "title": "Falling back in love with music",
                "excerpt": "Ditching web audio in favour of hardware synthesisers",
                "summary": [
                    "This is similar to what you've just read because both posts share a deep fascination with the technical aspects of sound production, with the second post focusing on the practical application and experience of creating unique sounds using modular synthesizers, drawing a connection between audio engineering and music creation that complements the technical discussion of decibels in the first post."
                ],
                "score": 0.7916899432196506
            }
        ]
    },
    "2017-03-31-echo-alexa-voice-interface-problems": {
        "relativePath": "2017-03-31-echo-alexa-voice-interface-problems",
        "hash": "763662584b8bb31063df1a9c7bbc619b1f89c7d636ce4be89849c185cd36bbeb",
        "summary": "Alexa, the Amazon Echo's virtual assistant, represents a significant breakthrough in voice-activated interfaces, but six months of hands-on experience has revealed certain limitations. Alexa's lack of precision in understanding voice commands and the inability to browse options as effectively as text-based searching are drawbacks. Additionally, the slight awkwardness of speaking out loud to a device, the lack of discreetness in a public setting, and the inability to distinguish between different voices can present problems. Furthermore, the risk of unauthorized access and absence of security protocols are concerning, as it allows others, including TV ads, to manipulate the device.\n\nDespite these issues, the convenience of Alexa greatly outweighs those disadvantages. The most appealing aspect of Alexa is the ability to interact with it in a natural, intuitive manner, particularly for functions such as playing music. Once the quirks of Alexa's individual user's music preferences are learned, the practicality of this feature becomes apparent. The \"always-on\" state of the device allows immediate interaction without the need to log in or boot up, providing a user experience that is quite appealing. But while Alexa is impressive for fetching trivia answers or scheduling reminders, music selection remains the standout application of this voice-activated virtual assistant.",
        "similarities": [
            {
                "relativePath": "2015-08-05-internet-fridge",
                "permalink": "/internet-fridge/",
                "date": "2015-08-05",
                "tags": "articles",
                "categories": [
                    "general"
                ],
                "title": "Why doesn’t everyone have an Internet Fridge?",
                "excerpt": "An internet-connected fridge is the go-to example when trying to explain the Internet Of Things to lay people. So why don't we have them yet? And do we really want them? Or even need them?",
                "summary": [
                    "This is similar to what you've just read because it goes deeper into challenges and potential benefits of another innovative technology that could potentially change the way we interact with our everyday devices, much like Alexa has."
                ],
                "score": 0.8063867715590015
            },
            {
                "relativePath": "2021-03-31-falling-back-in-love-with-music",
                "permalink": "/falling-back-in-love-with-music/",
                "date": "2021-03-31",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "audio"
                ],
                "title": "Falling back in love with music",
                "excerpt": "Ditching web audio in favour of hardware synthesisers",
                "summary": [
                    "This is similar to what you've just read because it also explores the intersection of technology and music, specifically on how manipulating controls and building custom hardware in modular synthesisers can create unique sounds and provide a satisfying physical experience, akin to the enjoyment of voice-activated music selection through Alexa."
                ],
                "score": 0.7907160088386375
            }
        ]
    },
    "2017-04-19-comic-sans-april-fool-disaster": {
        "relativePath": "2017-04-19-comic-sans-april-fool-disaster",
        "hash": "e59ed7fa11456dd7fe65134dada2c1c7a3c3af7431b69e9164502044493f3680",
        "summary": "In a playful take on humour through typography, I decided to change the font of my website to Comic Sans for April Fool's Day. As a seasoned typographer, I've been through the five stages of Comic Sans acceptance, so I thought it was about time to bring this love-hate relationship to new heights by featuring it on my website. With a few simple coding adjustments, I was able to make this change without much hassle. However, what I initially thought as a quick and funny prank turned out to be an enlightening experience about the realities of web design.\n\nMy Comic Sans prank not only amused me and some of my visitors, but it also taught me about the so-called \"web safe\" fonts. The prank totally failed on iOS, proving that what I assumed were 'web-safe' fonts can be quite the opposite in today's multi-device internet browsing habits. Apple, understandably, were not interested in bundling Comic Sans into their mobile operating system, rendering my prank virtually invisible on their devices.\n\nAnother lesson learnt was regarding the myth that good design should work with any typeface. In practice, it was indeed true that my designs remained functional when switched to Comic Sans, making for some office humour. However, the experience made me realise that a typeface has a crucial influence in setting the tone of the content, especially on sites that are predominantly text-based. So, while a design might technically work with various typefaces, it's definitely not a 'one size fits all' scenario.\n\nIn conclusion, my impromptu April Fool’s Day mischief resulted in a whole new perspective on web design, fonts and user experiences. Embrace the curveballs web design throws at you, and remember, a little bit of Comic Sans mischief can occasionally be a refreshing change!",
        "similarities": [
            {
                "relativePath": "2014-02-01-futura-for-the-win",
                "permalink": "/futura-for-the-win/",
                "date": "2014-02-01",
                "tags": "articles",
                "categories": [
                    "typography"
                ],
                "title": "Futura for the win",
                "excerpt": "Picking the right typeface for this site took a long time, and my final choice wasn’t one I was expecting. Ask 3-months-ago-me if I'd set a website entirely in Futura and I'd have laughed at you.",
                "summary": [
                    "This is similar to what you've just read because it also explores the importance of font selection in web design, focusing on how a shift from expected typography, in this case to Futura, can significantly influence both the design process and the overall user experience."
                ],
                "score": 0.8753413992240249
            },
            {
                "relativePath": "2015-05-31-inline-svg-icons",
                "permalink": "/inline-svg-icons/",
                "date": "2015-05-31",
                "tags": "articles",
                "categories": [
                    "code"
                ],
                "title": "Getting started with inline SVG icons",
                "excerpt": "As a typography nerd, using a custom font to serve icons felt really good. However, it turns out inline SVG icons are better in almost every way.",
                "summary": [
                    "This is similar to what you've just read because it similarly explores the hidden complexities of web design elements (from typography in the first post, to icon usage in the second) and their unexpected impact on user experience and site performance."
                ],
                "score": 0.8454283455194485
            }
        ]
    },
    "2017-04-30-picobel-js-css-audio-player": {
        "relativePath": "2017-04-30-picobel-js-css-audio-player",
        "hash": "bf50e676cf4d138f8bf504d9a28f7c95dc861ac140e253222a38a2bef6fcbad1",
        "summary": "Announcing Picobel.js, a first-of-its-kind open source project. It's a lightweight Javascript tool that adds a much-needed touch of style to on-site audio players. The inspiration to create this particular tool stemmed from my indepth exploration of CSS, as part of my music review blog. My endeavors to creatively express through styling was always stunted when it came to audio elements. Picobel.js was born out of this frustration and effectively bypasses the handicap of the native HTML5 audio player. Bye, bye shadow DOM inconsistencies!\n\nBy simply converting audio tags into styleable markup, Picobel.js paves way for personal customization and also comes with \"out of the box\" themes for those among you who aren't particularly CSS-savvy. The ease of use is the major highlight and it can be readily moulded to fit any workflow, making it highly user-friendly. Despite being a debutant in the open-source world, the Github repo is replete with detailed documentation as well as installation guides, pre-made theme showcases, an official open-source license and even a build-status widget! As of now, the only gaps in the program's functionality are edge-cases and failure states, likely to be addressed in the next version. Take part in beta testing and help turn it into a polished, finished product!",
        "similarities": [
            {
                "relativePath": "2017-06-28-you-can-now-install-picobel-using-npm",
                "permalink": "/you-can-now-install-picobel-using-npm/",
                "date": "2017-06-28",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "audio",
                    "code"
                ],
                "title": "You can now install Picobel using NPM",
                "excerpt": "Picobel is my open source JavaScript tool for turning HTML audio tags into styleable markup.",
                "summary": [
                    "This is similar to what you've just read because it continues the discussion on the Picobel.js tool, including its conversion into a node package, the maintenance of its core features, and some future plans for its development."
                ],
                "score": 0.9230854604194307
            },
            {
                "relativePath": "2020-12-30-web-audio-delay",
                "permalink": "/web-audio-delay/",
                "date": "2020-12-30",
                "tags": [
                    "articles",
                    "featured",
                    "intro"
                ],
                "categories": [
                    "audio",
                    "code"
                ],
                "title": "Building a delay effect with the Web Audio API",
                "excerpt": "An introduction to the power of JavaScript's Web Audio API",
                "summary": [
                    "This is similar to what you've just read because it also delves into the manipulation of audio elements in a web environment, but this time through utilizing JavaScript's Web Audio API to create unique sound effects, opening up another doorway for audio creativity."
                ],
                "score": 0.8177637952663595
            }
        ]
    },
    "2017-05-29-podcasts-recommended-listening": {
        "relativePath": "2017-05-29-podcasts-recommended-listening",
        "hash": "8ef5da672e6452fc90d44454f6b19abc012c1b35a411889341952a6284da2855",
        "summary": "If you're an ardent podcast listener or seeking to explore this fascinating world,  you may relish the recommendations in this post. A committed podcast listener for several years now, the author avidly consumes at least a couple of hours of podcasts daily during his long commutes. Bingeing on polished podcasts such as those from NPR and Gimlet Media, he adores the more unstructured presentations. By not adhering to any set format or time constraints, these empirically delve into topics getting less attention.\n\nThe author's favourites range from tech to business and general interest podcasts. For tech podcasts, the preferences include 'Shop talk Show', 'ATP', 'CodePen Radio', 'a16z', and 'The Creative Coding Podcast'. These cover the spectrum from front-end web development to the intricate workings of silicon valley. The author's inclination for startup and business podcasts include 'Startup', 'The Tim Ferriss Show', 'Planet Money', and 'Boagworld' that give insights on starting a business, life-hacking, economics, and running a web business. General interest podcasts like 'Reply All', 'More or Less', 'To The F'ing Future', 'Song Exploder', and 'In Our Time' offer an eclectic mix that ranges from interesting news stories to a behind-the-scenes look at song composition. \n\nRegardless of whether you're a podcast novice or veteran, this curated list is sure to act as your guide to a riveting aural journey filled with a treasure trove of insights. Be sure to explore these, you might find some new favourites.",
        "similarities": [
            {
                "relativePath": "2021-09-27-podcasting-equipment",
                "permalink": "/podcasting-equipment/",
                "date": "2021-09-27",
                "tags": [
                    "articles",
                    "featured"
                ],
                "categories": [
                    "podcasting"
                ],
                "title": "Podcasting: what gear do you need?",
                "excerpt": "To record a good podcast you need three essential pieces of equipment and a little bit of skill.",
                "summary": [
                    "This is similar to what you've just read because it delves further into the podcasting sphere, which might appeal to tech savvy readers or those considering starting their own podcast after exploring the recommended podcasts in the first article."
                ],
                "score": 0.8344174016170013
            },
            {
                "relativePath": "2014-09-09-inspirational-web-people",
                "permalink": "/inspirational-web-people/",
                "date": "2014-09-09",
                "tags": "articles",
                "categories": [
                    "career"
                ],
                "title": "Inspirational Web People",
                "excerpt": "Taking time to credit the members of the digital-community that have shaped my career is something I should do more often. Here's a few people I've found personally inspiring.",
                "summary": [
                    "This is similar to what you've just read because it highlights some of the personalities behind leading tech and business podcasts, giving readers a deeper understanding of the creators behind shows mentioned in the listed recommendations."
                ],
                "score": 0.821068688709775
            }
        ]
    },
    "2017-06-28-you-can-now-install-picobel-using-npm": {
        "relativePath": "2017-06-28-you-can-now-install-picobel-using-npm",
        "hash": "686566ee29e4163e711726515b3dfbc5b7598bd2d51cca986fe7e88f2e025811",
        "summary": "Exciting news for all developers out there! I've just published Picobel, my open source JavaScript tool that converts HTML audio tags into styleable markup, as a node package. No longer an old-school jQuery plugin, Picobel is now aligning more with a modern development workflow. \n\nBut don't worry, Picobel's core functionality hasn't changed. It still replaces any audio tags on a web page with markup that you can style directly. You just have to call `Picobel();` in your script like before. The only difference is the way you now access the Picobel function. If you are still keen on including the script directly, you would need to reference the `picobel.legacy.js` file. Otherwise, you can install Picobel in your project with `npm install picobel —save` and then import it into your JS file with `import Picobel from ‘picobel’;`. Following that, you can call the `Picobel()` function like you always have. \n\nAnd if you need more information about utilizing options and themes with Picobel, consider checking out the README.md on the project’s GitHub page. But that's not all, this update is but a precursor to several upcoming ones. I am working on converting Picobel to ES6, expanding the test coverage to include all of Picobel’s internal methods and adding some popularly requested new features and themes.",
        "similarities": [
            {
                "relativePath": "2017-04-30-picobel-js-css-audio-player",
                "permalink": "/picobel-js-css-audio-player/",
                "date": "2017-04-30",
                "tags": "articles",
                "categories": [
                    "audio"
                ],
                "title": "Introducing Picobel.js - an audio player you can style with css",
                "excerpt": "Picobel.js is a lightweight dependency-free Javascript tool that converts html audio tags into styleable markup.",
                "summary": [
                    "\"This is similar to what you've just read because it also discusses the origins and functionalities of Picobel.js, an open-source JavaScript tool for styling audio tags, but from a more conceptual and historical perspective, which could give you a better understanding of the project's inception and goals.\""
                ],
                "score": 0.9230854604194307
            },
            {
                "relativePath": "2022-10-24-oblique-strategies-via-npx",
                "permalink": "/oblique-strategies-via-npx/",
                "date": "2022-10-24",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "code"
                ],
                "title": "Oblique Strategies via npx",
                "excerpt": "A node script that prints one of Brian Eno's Oblique Strategies into your terminal",
                "summary": [
                    "This is similar to what you've just read because it also discusses the creation and use of a unique node package that can be utilized by developers for an innovative and creative purpose, and the source code for the package can be found on GitHub."
                ],
                "score": 0.7863050597918745
            }
        ]
    },
    "2018-07-01-writing-well": {
        "relativePath": "2018-07-01-writing-well",
        "hash": "2c5e989587a559a8d0e739c120d131f71f81934880d2af6716e40d67363b79de",
        "summary": "As a developer, I've found my written communication skills just as vital as my technical ones. Writing well, especially when it comes to complex subjects like code, isn't easy but it's a skill that's been completely transformational for me. Shaping your communication to be clear and concise is an art, one that you especially need to master when dealing with clients who don't have a background in tech. \n\nNavigating misunderstandings in the past gave me insights into solving this non-trivial problem. Alongside hard-earned experience, the mantra of brevity and tactical repetition proved to be a key player in enhancing my communication. Making your points succinct and preventing a \"wall of text\" scenario helps the reader understand the essence of your message. Along with this, repeating critical points in different ways reduces the chances of misinterpretation and encourages recipients to actively ask for clarifications if needed.\n\nFollowing these techniques undoubtedly refined my professional interactions, but the effects did not just stop at clients. Most of my workplace communication now happens on virtual platforms, and well-written documentation for your code can save countless hours in the long run. Bottom line, never underestimate the power of good communication. Write and write often. As I see it, a marginal gain in writing skills can have a more profound impact than a similar gain in coding skills. So, yes, don't just code, communicate.",
        "similarities": [
            {
                "relativePath": "2013-09-26-simple-is-hard",
                "permalink": "/simple-is-hard/",
                "date": "2013-09-26",
                "tags": "articles",
                "categories": [
                    "general"
                ],
                "title": "Simple is hard",
                "excerpt": "How I learnt to focus on substance over style, and began to rethink my relationship with ‘good design’.",
                "summary": [
                    "This is similar to what you've just read because it further explores the balance between clarity and complexity, but in design and presentation of content rather than written communication."
                ],
                "score": 0.8403003646411643
            },
            {
                "relativePath": "2016-09-28-a-good-readme",
                "permalink": "/a-good-readme/",
                "date": "2016-09-28",
                "tags": "articles",
                "categories": [
                    "code",
                    "career"
                ],
                "title": "You are only as good as your README",
                "excerpt": "All code is an abstraction. If we were writing explicitly for computers we would write in machine code or assembly-language. We don't, because \"hello world\" would take months to write. So instead of typing in binary, we use languages that hide the mess out of sight.",
                "summary": [
                    "This is similar to what you've just read because it underscores the importance of written communication in the technical field, focusing specifically on the role of README files in code comprehension and overall project success."
                ],
                "score": 0.8304536455263357
            }
        ]
    },
    "2019-08-21-rugby-world-cup-2019": {
        "relativePath": "2019-08-21-rugby-world-cup-2019",
        "hash": "6eda262d1a67c246dfa5864e1289f62bca7d7299bad52661a7e091fb1c5087ab",
        "summary": "This blog post explores the use of world rankings data and data visualisation techniques to predict the results of the pool stages of the 2019 Rugby World Cup. The author argues that despite their limitations, world rankings, expressed either in terms of rank or points, can be used as predictors of a team's success. To test this idea, the author presents an algorithm that calculates a team's chance of winning a match based on rank or points and provides a probability value.\n\nHowever, due to the limitations of solely relying on ranks or points (e.g., the ordinal nature of ranks, the points-based system favouring lower-tier teams), the author tweaks the algorithm by multiplying each team's points by a power, with 5 deemed to be the most fitting exponent. This creates a progressive advantage which slightly favours top-tier teams, further aligning the results with the author's expectations. They then utilise the updated algorithm to predict the outcomes of the World Cup pool matches. The caveat is that these predictions are all based on the author's personal experience with rugby and their own subjective bias in manipulating the statistical model.",
        "similarities": [
            {
                "relativePath": "2019-09-07-rugby-world-cup-predictions",
                "permalink": "/rugby-world-cup-predictions/",
                "date": "2019-09-07",
                "tags": "articles",
                "categories": [
                    "data"
                ],
                "title": "Algorithmically predicting the results of the 2019 Rugby World Cup",
                "excerpt": "Data visualisation and prediction algorithm for the 2019 Rugby World Cup",
                "summary": [
                    "This is similar to what you've just read because the second post also discusses a unique algorithm for predicting Rugby World Cup outcomes using performance data, broadening the scope of considerations beyond world rankings and providing an alternative perspective on mathematical modelling in sports prediction."
                ],
                "score": 0.9102657613967892
            },
            {
                "relativePath": "2019-12-30-rugby-prediction-retrospective",
                "permalink": "/rugby-prediction-retrospective/",
                "date": "2019-12-30",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "data"
                ],
                "title": "Rugby prediction: retrospective",
                "excerpt": "Data visualisation and prediction algorithm for the 2019 Rugby World Cup",
                "summary": [
                    "This is similar to what you've just read because it provides a follow-up perspective from an author who had also developed a Rugby prediction algorithm, and shares the subsequent lessons learned after experiencing the unpredictable nature of sports outcomes."
                ],
                "score": 0.8852352377655032
            }
        ]
    },
    "2019-09-07-rugby-world-cup-predictions": {
        "relativePath": "2019-09-07-rugby-world-cup-predictions",
        "hash": "35c58e3275c11563daa6250aa2896ede8c1240fc9af037ac95d3d928807b6732",
        "summary": "For years, I've dedicated myself to developing an algorithm capable of predicting rugby match outcomes. While the World Rugby rankings offer valuable insight into past performance, they lack the ability to fully predict future results. To address this, I've created a model that considers more than just past form but also recent performance and past encounters with particular competition. \n\nThe model synthesizes four key metrics: all-time performance, recent form against tier 1 and tier 2 teams, and history against a specific opponent. As with any experimental algorithm, this one has room for improvement, expansion, and further refining. Nevertheless, the imminent onset of the Rugby World Cup compels me to share it as is. The predictions, embedded in the full post, aim to provide a mathematical perspective on how the Cup might unfold. Every fan has their predictions, so why not throw an algorithm into the mix?",
        "similarities": [
            {
                "relativePath": "2019-12-30-rugby-prediction-retrospective",
                "permalink": "/rugby-prediction-retrospective/",
                "date": "2019-12-30",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "data"
                ],
                "title": "Rugby prediction: retrospective",
                "excerpt": "Data visualisation and prediction algorithm for the 2019 Rugby World Cup",
                "summary": [
                    "\"This is similar to what you've just read because it's a follow-up on the same theme, discussing the author's experience and learnings from using the mentioned rugby prediction algorithm in real-world scenarios.\""
                ],
                "score": 0.9348652778800586
            },
            {
                "relativePath": "2019-08-21-rugby-world-cup-2019",
                "permalink": "/rugby-world-cup-2019/",
                "date": "2019-08-21",
                "tags": "articles",
                "categories": [
                    "data"
                ],
                "title": "Using world ranking to predict the results of the 2019 Rugby World Cup pool stages",
                "excerpt": "Data visualisation for the pool stages of the 2019 Rugby World Cup",
                "summary": [
                    "This is similar to what you've just read because both posts discuss predictive algorithms for Rugby World Cup match outcomes, use world ranking data as a primary input, and acknowledge their inherent limitations and room for improvements."
                ],
                "score": 0.9102657613967892
            }
        ]
    },
    "2019-12-30-rugby-prediction-retrospective": {
        "relativePath": "2019-12-30-rugby-prediction-retrospective",
        "hash": "89b54f6aa99bdd4c4c2670f66d949e21bc01c86adc1e1323c31b61247c96e3cd",
        "summary": "In my 2019 article titled \"Rugby prediction: retrospective\", I described my humbling experience of developing an algorithm to predict the outcome of the Rugby World Cup. Having been confident enough to make real bets based on my forecasts, I was quickly reminded of the unpredictability inherent to sports. No matter how much data you wield or how complex your predictions, they can fall apart from the second weekend of matches.\n\nIn my case, I found that I had underestimated the impact of individual players and overestimated the impact of overall team performance. I was also off in my understanding of team tiers, which could be classified as more nuanced than a simple two-tier system. Moreover, I had failed to realize the profound effect of a team's strategy and tactics on performance. My algorithm didn't take into account in-game management, strategic play, or teams that specifically gear up for certain matches. Lastly, I hadn't considered the phenomena of teams either choking on big days or over-performing.\n\nDespite the hard lesson learned, I don't regret the experience. The stakes of real-life bets made each match that much more exciting. Also, I find the World Cup of 2019 to be one of the most entertaining and surprising of all. Needless to say, work will continue on the algorithm, and I'm already looking forward to the 2020 Six Nations!",
        "similarities": [
            {
                "relativePath": "2019-09-07-rugby-world-cup-predictions",
                "permalink": "/rugby-world-cup-predictions/",
                "date": "2019-09-07",
                "tags": "articles",
                "categories": [
                    "data"
                ],
                "title": "Algorithmically predicting the results of the 2019 Rugby World Cup",
                "excerpt": "Data visualisation and prediction algorithm for the 2019 Rugby World Cup",
                "summary": [
                    "\"This is similar to what you've just read because it also focuses on the development of a rugby match outcome prediction algorithm, detailing a different approach which incorporates various performance metrics, providing a fresh perspective for refining your own predictive model.\""
                ],
                "score": 0.9348652778800586
            },
            {
                "relativePath": "2019-08-21-rugby-world-cup-2019",
                "permalink": "/rugby-world-cup-2019/",
                "date": "2019-08-21",
                "tags": "articles",
                "categories": [
                    "data"
                ],
                "title": "Using world ranking to predict the results of the 2019 Rugby World Cup pool stages",
                "excerpt": "Data visualisation for the pool stages of the 2019 Rugby World Cup",
                "summary": [
                    "This is similar to what you've just read because it explores another approach to predicting rugby match outcomes through algorithm and data, focusing on the influence of world rankings, which you might find interesting given your previous interest in developing prediction algorithms for rugby matches."
                ],
                "score": 0.8852352377655032
            }
        ]
    },
    "2020-01-07-eleventy-static-site-generator": {
        "relativePath": "2020-01-07-eleventy-static-site-generator",
        "hash": "620992fe1a992a30c8d7c3b4f6599431bcba5e9fa7266fc9462610773f83c01c",
        "summary": "The blog post expresses an obsession with static site generators (SSGs), which convert simple markdown files into a highly efficient website. The post comprises the tale of a journey to find the perfect SSG, starting with WordPress, moving to HTML, onto Jekyll, then Gatsby and Hugo, and ultimately landing on [Eleventy](https://www.11ty.dev/) as the firm favorite. \n\nWordPress proves not to be the performance bottleneck it's often made out to be, but the author experiences friction with the WP dashboard due to its lack of customization. Vanilla HTML, though intellectually stimulating, quickly becomes unwieldy with the addition of more pages. Jekyll is a relief compared to WordPress and HTML, but becomes a little too Ruby-focused in the long run, and the love affair cools off. Gatsby introduces the React-single page application alongside the benefits of statically generated sites, but the complexities of GraphQL turn off the author. Hugo holds its own due to its GoLang feature, but in the end, gives way to Eleventy. \n\nEleventy, written in JavaScript and combining the best of Hugo and Jekyll, emerges as the favorite. It offers the ability to keep things simple and intuitive, and fits neatly into the existing workflow automation. Pagination and simulation of different post types may still cause issues, but the opportunity to contribute to its development is a tempting prospect. The author may be lured away by a newer, shinier SSG in the future, but for now, Eleventy does everything needed and continues to stay out of the way of their workflow.\n",
        "similarities": [
            {
                "relativePath": "2021-01-17-adding-rss",
                "permalink": "/adding-rss/",
                "date": "2021-01-17",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "code"
                ],
                "title": "RSS in 2021 (yes, it's still a thing)",
                "excerpt": "Adding an RSS feed to an Eleventy site is (mostly) easy peasy.",
                "summary": [
                    "This is similar to what you've just read because it continues the discussion on blog site optimization and explores the implementation of RSS feeds, also using Eleventy, which was the chosen static site generator in the first blog post."
                ],
                "score": 0.8237468720779031
            },
            {
                "relativePath": "2015-05-31-inline-svg-icons",
                "permalink": "/inline-svg-icons/",
                "date": "2015-05-31",
                "tags": "articles",
                "categories": [
                    "code"
                ],
                "title": "Getting started with inline SVG icons",
                "excerpt": "As a typography nerd, using a custom font to serve icons felt really good. However, it turns out inline SVG icons are better in almost every way.",
                "summary": [
                    "This is similar to what you've just read because it details a technical journey of switching between different tools (from icon fonts to SVG sprites) just like the first post's journey through different static site generators."
                ],
                "score": 0.8190045521541176
            }
        ]
    },
    "2020-01-17-things-i-use": {
        "relativePath": "2020-01-17-things-i-use",
        "hash": "b5933503a60bda914f1c857734dba56ceae4fc4198dddf5899d38f407534fd61",
        "summary": "In the newest post on my blog, I talk about my insatiable curiosity for the technical world. Specifically, my ever-growing hunger for new technological discoveries, which I lovingly term as being \"nerd sniped\". Occasionally, a certain link or idea will pique my interest to the point of obsession. A recent benign example of this is Wes Bos' [uses.tech](https://uses.tech/), a comprehensive catalogue of every gadget used by tech bloggers. Seeing that, I just had to create my own comprehensive list of tools I use [tomhazledine.com/uses](https://tomhazledine.com/uses/)\n\nThe \"uses\" page I created is a detailed catalogue of items I utilize daily. This includes everything from basic hardware like computers and laptops, to more specialized equipment for video and audio-related tech for my podcasting and occasional coding videos. It even extends to my art and design tools, with everything from fancy sketchbooks to what I refer to as The World's Best Pencil. This catalogue is not comprehensive yet – a few essential tools I use daily are yet to make it to the list. The dynamic nature of this list mandates regular updates, especially since I haven't even started to list the software I use! \n\nCreating this 'Uses' page is not just a fun endeavor - it's interesting and enriching to see what tools other professionals are using. We can all gain a lot from learning about each other's tech stacks. I encourage you to glean insights from it, and if you feel up to it, create your own and share it with me!",
        "similarities": [
            {
                "relativePath": "2017-01-20-bullet-journal-revisited",
                "permalink": "/bullet-journal-revisited/",
                "date": "2017-01-20",
                "tags": [
                    "articles",
                    "popular"
                ],
                "categories": [
                    "general",
                    "productivity"
                ],
                "title": "Bullet Journal Revisited",
                "excerpt": "The Bullet Journal is a system for Getting Things Done. One nested pen-and-paper list that gets rewritten every morning.",
                "summary": [
                    "This is similar to what you've just read because it gives insight into the efficiency techniques and digital tools employed by the author for productivity, much like the 'Uses' page which catalogues their essential tech tools."
                ],
                "score": 0.8192566716891442
            },
            {
                "relativePath": "2013-09-24-bullet-journal-workflow",
                "permalink": "/bullet-journal-workflow/",
                "date": "2013-09-24",
                "tags": "articles",
                "categories": [
                    "general",
                    "productivity"
                ],
                "title": "A bullet-journal workflow",
                "excerpt": "An analogue to-do list system. To-do lists are usually just a short-term fix, but I've found a system that stays relevant.",
                "summary": [
                    "This is similar to what you've just read because both posts delve into specific tools and systems the author uses for organization and productivity in their daily tech-based routine."
                ],
                "score": 0.8164085670861283
            }
        ]
    },
    "2020-02-17-twitter-cards-with-nunjucks-and-eleventy": {
        "relativePath": "2020-02-17-twitter-cards-with-nunjucks-and-eleventy",
        "hash": "2279057761049689b206f29dbfea7b34a1eaf6b204b78c9cd34d9578a5d05163",
        "summary": "Creating captivating Twitter Cards with Nunjucks and 11ty can be a game-changer for your website or blog. When you share your webpage URL on Twitter, Twitter Cards convert your simple text link into a rich card featuring a catchy image and structured title along with description data. This gives your shared links a much more appealing look. \n\nHowever, this charming feature is not universally applicable to all links. The webpage you're linking to needs to house some Twitter-specific metadata within its 'head.' The post explains how to create this metadata using  [Eleventy](https://www.11ty.dev/) and the [Nunjucks](https://mozilla.github.io/nunjucks/) templating engine. The master layout file needs to include metadata, which must accommodate a few various scenarios, such as pages without an image and the switch of a card's 'type.'\n\nAlthough it might take some trials to achieve perfect image loading, the effort is worth it. Furthermore, resources like the Twitter [Card validator](https://cards-dev.twitter.com/validator) tool allow you to test and debug without having to spam followers with tweets packed with broken links.",
        "similarities": [
            {
                "relativePath": "2021-01-17-adding-rss",
                "permalink": "/adding-rss/",
                "date": "2021-01-17",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "code"
                ],
                "title": "RSS in 2021 (yes, it's still a thing)",
                "excerpt": "Adding an RSS feed to an Eleventy site is (mostly) easy peasy.",
                "summary": [
                    "This is similar to what you've just read because it also details the application of a specific feature using the Eleventy tool, in this case, integrating RSS feeds into a personal blog for optimized content sharing and delivery."
                ],
                "score": 0.8166670078294536
            },
            {
                "relativePath": "2020-01-07-eleventy-static-site-generator",
                "permalink": "/eleventy-static-site-generator/",
                "date": "2020-01-07",
                "tags": [
                    "articles",
                    "featured",
                    "popular"
                ],
                "categories": [
                    "code"
                ],
                "title": "Static site generators: Hugo vs Jekyll vs Gatsby vs 11ty",
                "excerpt": "I have an obsession with SSGs, and Eleventy is my favourite (even better than Hugo, Jekyll, and Gatsby).",
                "summary": [
                    "This is similar to what you've just read because it further explores the functionalities of Eleventy, an aspect that was touched on in the first post, and it details the author's journey and reasoning for selecting Eleventy as their preferred static site generator."
                ],
                "score": 0.8036363418916375
            }
        ]
    },
    "2020-04-09-css-naked-day": {
        "relativePath": "2020-04-09-css-naked-day",
        "hash": "1b0a464c657f2b52ce86d7ec6411dc8ef35ef92baf1b765d818aca8dee4396e3",
        "summary": "In this blog post, I celebrate CSS Naked Day, a one-time annual event that honors clean and clear markup. As a web developer who firmly supported the advent of Web 2.0, I am in favour of supporting semantic markup. I have previously shared my views on how HTML does not require much styling to be fully functional. So, it brings me great joy to share the fact that today, the 9th of April, is officially recognized as CSS Naked Day.\n\nNow, if you're reading this on the very day, you'll notice my whole site without any CSS. However, if you browse this on any other day, you'll find only this page unstyled. This exercise, though fun, is aimed at making a serious point. A significant number of people interact with the web using simple markup via screen readers, automated delivery mechanisms like web scrappers, and RSS feeds. Therefore, how we structure our documents becomes highly crucial. This essentially underlines my commitment towards promoting more accessible and inclusive web practices, ensuring a seamless experience for all.",
        "similarities": [
            {
                "relativePath": "2017-01-15-html-doesnt-need-any-styling",
                "permalink": "/html-doesnt-need-any-styling/",
                "date": "2017-01-15",
                "tags": "articles",
                "categories": [
                    "code"
                ],
                "title": "Well-written HTML doesn't need any styling. Except that it does.",
                "excerpt": "One of the best things about HTML is that it just works. As with much of the web, things only get weird when designers and developers start adding things.",
                "summary": [
                    "This is similar to what you've just read because it continues exploring the importance of website readability and the role of CSS and HTML markup in this regard, while focusing on the line-length issue faced in pure HTML, and offers solutions to improve reader comfort by in-lining CSS rules within HTML."
                ],
                "score": 0.8182396699623181
            },
            {
                "relativePath": "2013-09-26-simple-is-hard",
                "permalink": "/simple-is-hard/",
                "date": "2013-09-26",
                "tags": "articles",
                "categories": [
                    "general"
                ],
                "title": "Simple is hard",
                "excerpt": "How I learnt to focus on substance over style, and began to rethink my relationship with ‘good design’.",
                "summary": [
                    "This is similar to what you've just read because both blog posts emphasize the significance of simple, content-focused design and accessibility in web development, balancing aesthetics with clean, understandable user interface."
                ],
                "score": 0.8054346122073208
            }
        ]
    },
    "2020-04-28-installing-acoustic-panels": {
        "relativePath": "2020-04-28-installing-acoustic-panels",
        "hash": "326eca502e06bf6fa4b211f1e400ca56a33f227e38a6ccbccd1b1404bcd78676",
        "summary": "As a passionate podcaster, I make consistent efforts to improve the sound quality of my show, which I liken to a serious hobby. This week, I took a significant step in that direction by installing acoustic panels in my office. I fundamentally believe in the principle of achieving small but consistent improvements rather than a single large purchase. Any microphone can deliver impressive quality given the right technique and discipline. But it's also important to enhance the acoustic quality of the recording space.\n\nI tackled an issue with room noise in my office, caused predominantly by the reflections and reverberations of my voice off hard, flat surfaces. As a solution, I installed acoustic panels on a large flat wall behind my desk. These panels, simple pads of foam stuck to the wall, are designed to reduce reflections. Although other superior options exist, my preference was for convenience over luxurious soundproofing. \n\nThe installation process was tricky, with my initial efforts, using sticky pads as an adhesive, proving unsuccessful. After further research, I glued the panels to large pieces of cardboard and attached these to the wall, which finally yielded a more reliable result. Based on my experience, I recommend applying a sturdy backing to the foam panels and ensuring they're securely attached before mounting them on the wall. From now, my audience can tune into future episodes of my podcast, A Question of Code, and judge for themselves if the improved acoustics are noticeable.\n",
        "similarities": [
            {
                "relativePath": "2021-09-27-podcasting-equipment",
                "permalink": "/podcasting-equipment/",
                "date": "2021-09-27",
                "tags": [
                    "articles",
                    "featured"
                ],
                "categories": [
                    "podcasting"
                ],
                "title": "Podcasting: what gear do you need?",
                "excerpt": "To record a good podcast you need three essential pieces of equipment and a little bit of skill.",
                "summary": [
                    "This is similar to what you've just read because it continues the theme of podcasting quality by going deeper into the equipment side, such as microphone types and recording software, complementing the first post's focus on the importance of room acoustics and soundproofing."
                ],
                "score": 0.8482620647094797
            },
            {
                "relativePath": "2017-05-29-podcasts-recommended-listening",
                "permalink": "/podcasts-recommended-listening/",
                "date": "2017-05-29",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "podcasting"
                ],
                "title": "Recommended Listening: my favourite podcasts",
                "excerpt": "Without any constraints of format or time, the best podcasts get to dive deep into topics that wouldn't otherwise get covered.",
                "summary": [
                    "This is similar to what you've just read because it also revolves around the theme of podcasting, but explores it from a listener's perspective, suggesting numerous podcast recommendations which might align with your interest in acoustic quality."
                ],
                "score": 0.7961250404055279
            }
        ]
    },
    "2020-05-06-bullet-journal-redux": {
        "relativePath": "2020-05-06-bullet-journal-redux",
        "hash": "d433d5035a2d17c69bd9b576dd259038bb72b0585c790d2cacf5878d3273cd86",
        "summary": "In my latest reflections on Bullet Journaling, I've uncovered a surprising pattern. I discovered my journal use correlated with periods of stress, uncertainty, and change in my personal and professional life. Starting as a tool for organizing my freelance work, the journal was repeatedly dropped and picked up again during times of change or crisis, such as job hunting or navigating company shutdowns. \n\nInterestingly, I picked up journalling again recently as the world is engulfed by the global pandemic. This made it clear that for me, journalling isn't a continual daily habit but a coping mechanism during crisis points. Staying updated with my journal during these periods allows me to stay productive and regain a sense of control. Now, knowing the role of journalling in my life, I'm no longer guilty of not maintaining it all the time. It serves its purpose when needed, performing the function of a tool that gets me back on track before I reach a productivity crisis.",
        "similarities": [
            {
                "relativePath": "2013-09-24-bullet-journal-workflow",
                "permalink": "/bullet-journal-workflow/",
                "date": "2013-09-24",
                "tags": "articles",
                "categories": [
                    "general",
                    "productivity"
                ],
                "title": "A bullet-journal workflow",
                "excerpt": "An analogue to-do list system. To-do lists are usually just a short-term fix, but I've found a system that stays relevant.",
                "summary": [
                    "\"This is similar to what you've just read because it expands on the practical application and benefits of the Bullet Journal system, offering tangible ways to increase productivity, which may enhance your understanding and effectiveness of the coping mechanism discussed in the first post.\""
                ],
                "score": 0.9005965375789721
            },
            {
                "relativePath": "2017-01-20-bullet-journal-revisited",
                "permalink": "/bullet-journal-revisited/",
                "date": "2017-01-20",
                "tags": [
                    "articles",
                    "popular"
                ],
                "categories": [
                    "general",
                    "productivity"
                ],
                "title": "Bullet Journal Revisited",
                "excerpt": "The Bullet Journal is a system for Getting Things Done. One nested pen-and-paper list that gets rewritten every morning.",
                "summary": [
                    "\"This is similar to what you've just read because it also discusses the use of Bullet Journaling for productivity purposes and outlines an adaptive approach to journaling tactics for managing tasks and goals, taking you through an effective digital adaptation of the traditional process.\""
                ],
                "score": 0.8944423399669991
            }
        ]
    },
    "2020-11-19-dark-mode": {
        "relativePath": "2020-11-19-dark-mode",
        "hash": "a00490cdff92338a098c62bcdc8956871220e8de0ce683c73bc973b50c140fd0",
        "summary": "The post explores implementing a dark mode theme in the context of a web blog using CSS custom properties, SASS, and JavaScript. Initially driven by sibling rivalry, the author explores three main areas required to successfully implement this feature: the basics, removable themes with CSS custom properties, and toggling dark-mode without changing a system-wide preference.\n\nFor the basics, the author uses the `prefers-color-scheme` media query and provides a brief explanation and example of how it can be used to apply a dark mode theme. Then the post delves into defining dynamic themes with CSS custom properties, which are native CSS variables with the ability to change value depending on their context. The author explains how utilizing native CSS custom properties lets you dynamically adjust themes but also outlines some of the challenges encountered, especially when it comes to using custom properties alongside SASS.\n\nThe final section handles live switching, i.e., allowing users to toggle dark-mode without having to change a system-wide preference. This is achieved using JavaScript to dynamically modify a data attribute on the root of the webpage and storing the user's preference in localStorage. Finally, a UI element, in this case a button, that allows users to toggle between the different modes is introduced. Completed with a callback to his brother's page, the author finishes his blog post by reflecting on the experience, concluding that he managed to establish dark-mode quite successfully on his site.",
        "similarities": [
            {
                "relativePath": "2017-04-30-picobel-js-css-audio-player",
                "permalink": "/picobel-js-css-audio-player/",
                "date": "2017-04-30",
                "tags": "articles",
                "categories": [
                    "audio"
                ],
                "title": "Introducing Picobel.js - an audio player you can style with css",
                "excerpt": "Picobel.js is a lightweight dependency-free Javascript tool that converts html audio tags into styleable markup.",
                "summary": [
                    "\"This is similar to what you've just read because it offers another practical example of using JavaScript and CSS to customize user experience on a webpage, focusing on transforming audio players rather than implementing a dark mode theme.\""
                ],
                "score": 0.7972078800012027
            },
            {
                "relativePath": "2015-05-31-inline-svg-icons",
                "permalink": "/inline-svg-icons/",
                "date": "2015-05-31",
                "tags": "articles",
                "categories": [
                    "code"
                ],
                "title": "Getting started with inline SVG icons",
                "excerpt": "As a typography nerd, using a custom font to serve icons felt really good. However, it turns out inline SVG icons are better in almost every way.",
                "summary": [
                    "This is similar to what you've just read because it deals with practical solutions to enhance web design, focusing on how to improve visual elements using SVG sprites, just as the first post focused on using CSS and JavaScript to implement a dark mode theme."
                ],
                "score": 0.7947165748372759
            }
        ]
    },
    "2020-12-30-web-audio-delay": {
        "relativePath": "2020-12-30-web-audio-delay",
        "hash": "c38a5d10628c4e259b84f6013eb371ff3fc8b0225a4c9161365be07d5e20fd8c",
        "summary": "In this blog post, we walk through replicating a delay pedal using JavaScript's Web Audio API. After initiatiing an audio context to connect with the browser's audio capabilities, we go into creating an analogue _signal path_ using an oscillator and a gain node. Throughout the process, we ensure the functionality works on multiple browser types.\n\nOur sound’s initial stop and start functions feel jarring, so we utilise a gain node to soften this. We later create random pitches for our sound to enhance its musical feeling. These pitches use an array of note values, creating a melody within the C major scale.\n\nDuplication of notes gives our sound a more 'full' feeling. However, instead of duplicating it entirely, we transpose the second sound to be seven steps higher - creating a more harmonious combination. Then, we introduce an effects unit in our signal path right between the instrument and the mixer. This unit takes the signal, modifies it, and sends it back to the mixer alongside the original signal. \n\nThough it works, this merely creates a single delay. We thereafter introduce the idea of feedback, a principle of feeding back a fraction of the delayed signal back into the delay module. This achieves an audible delay creating fuller, more dynamic effects. Finally, we enable interaction through HTML range elements, allowing tweaking of delay duration and feedback level for diverse sounds.\n\nThis post showcases the broad capabilities of the browser's audio context, opening the door to endless creativity. Feel free to use this information for your own sound experiments and don't hesitate to share your creations!",
        "similarities": [
            {
                "relativePath": "2021-07-21-line-graphs-with-react-svg-d3",
                "permalink": "/line-graphs-with-react-svg-d3/",
                "date": "2021-07-21",
                "tags": [
                    "articles",
                    "featured",
                    "intro"
                ],
                "categories": [
                    "audio",
                    "code"
                ],
                "title": "Line graphs with React and D3.js",
                "excerpt": "Generating a dynamic SVG visualisation of audio frequency data.",
                "summary": [
                    "This is similar to what you've just read because it also explores the use of JavaScript tools (React, SVG and D3.js in this case) to manipulate audio data, showing how to visualize audio frequency using dynamic line graphs instead of creating audio effects."
                ],
                "score": 0.8514342898798005
            },
            {
                "relativePath": "2021-03-31-falling-back-in-love-with-music",
                "permalink": "/falling-back-in-love-with-music/",
                "date": "2021-03-31",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "audio"
                ],
                "title": "Falling back in love with music",
                "excerpt": "Ditching web audio in favour of hardware synthesisers",
                "summary": [
                    "This is similar to what you've just read because it explores the author's personal journey in music and front-end engineering, particularly focusing on how JavaScript and the Web Audio API are used to create and manipulate sounds, just like how a delay pedal was replicated in the first post."
                ],
                "score": 0.8285747637244729
            }
        ]
    },
    "2021-01-17-adding-rss": {
        "relativePath": "2021-01-17-adding-rss",
        "hash": "dc06135a5e8d15a6076aafb065438d45c3a84752610815ccf2986469a52318f7",
        "summary": "In this blog post, I explore the relevance of RSS (Rich Site Summary) in 2021 by sharing my fondness for the medium and how I integrated it into my personal blog. I am an avid fan of RSS for a couple of reasons. Firstly, it is the underlying tech that propels podcasts sharing, a platform I believe is one of the biggest lifetime contributions to knowledge sharing and distribution. I equally cherish RSS because it provides a direct delivery channel for me to stay updated with content from authors/bloggers I follow. Interestingly, the simplicity of RSS lies in its ability to facilitate content delivery devoid of algorithmic interferences and intrusive ads. \n\nRecently, I added an RSS feed to my blog and described the process in this post. Firstly, I created a 'feed.xml' page in my content directory with Eleventy. After this, I worked on the template structure for my feed, factoring in the need to validate the XML document to meet the standard. I ensured to cater for any unique situations that might affect my content delivery through RSS, in case they are not compatible. In the end, I simply validated my feed, tested it through my local host and published it live on my site. If you're a fan of RSS like me, you can now enjoy my content straight from your reader.\n",
        "similarities": [
            {
                "relativePath": "2020-01-07-eleventy-static-site-generator",
                "permalink": "/eleventy-static-site-generator/",
                "date": "2020-01-07",
                "tags": [
                    "articles",
                    "featured",
                    "popular"
                ],
                "categories": [
                    "code"
                ],
                "title": "Static site generators: Hugo vs Jekyll vs Gatsby vs 11ty",
                "excerpt": "I have an obsession with SSGs, and Eleventy is my favourite (even better than Hugo, Jekyll, and Gatsby).",
                "summary": [
                    "This is similar to what you've just read because it delves deeper into Eleventy, a tool used by the author in the first post to integrate RSS into their blog, and offers an exploration of static site generators, which might interest anyone seeking to streamline their content delivery or enhance their blogging setup."
                ],
                "score": 0.8237468720779031
            },
            {
                "relativePath": "2020-02-17-twitter-cards-with-nunjucks-and-eleventy",
                "permalink": "/twitter-cards-with-nunjucks-and-eleventy/",
                "date": "2020-02-17",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "code"
                ],
                "title": "Twitter Cards with Nunjucks and 11ty",
                "excerpt": "Using cards makes sharing your content on Twitter look much nicer.",
                "summary": [
                    "This is similar to what you've just read because it also discusses further enhancement of a blog by enriching shared content on social media platforms, specifically Twitter, using Eleventy and Nunjucks, which may appeal to those interested in utilizing different avenues and tech tools for optimal content distribution and display."
                ],
                "score": 0.8166670078294536
            }
        ]
    },
    "2021-02-07-year-of-writing": {
        "relativePath": "2021-02-07-year-of-writing",
        "hash": "aced9e9d5e0cda5f58e4ece2198fc406069a4ec848eda4f89d9d28c8636e5d9c",
        "summary": "My strategy for 2019 was to adopt a \"Yearly Theme\", a habit I've brought into 2021 after finding it successful in previous years. Unlike fleeting New Year's resolutions, a Yearly Theme is a guiding principle for the entire year, inspired by CGP Grey and Mike Hurley from the Cortex podcast. For a theme to be effective, it should provide clear guidance for decision-making, and be strategic enough to involve a distinct path, having a logical opposite. It should also be easy to remember, allowing it to govern my choices throughout the year.\n\nIn 2019, my theme was \"shipping\"; focusing on completing and releasing my projects. It was a challenging goal since I was used to tinkering without necessarily finishing. The result was a successful increase in product launches and a shift in approach that requires further work. In 2020, my theme was \"action\", symbolizing personal responsibility. The year certainly tested my resolve, but the theme was unmistakably apt. \n\nAs for 2021, I chose a dual theme that reflects my reignited passion for music and my commitment to blogging. Calling it my \"Year of Writing\", my aim is to release my music and double down on blogging. Given that both passions involve 'writing' in different forms, I find this theme fittingly comprehensive and I'm eager to see what it brings. Check in with me in 2022 to find out how the year transpired!",
        "similarities": [
            {
                "relativePath": "2021-04-30-learning-and-doing-in-public",
                "permalink": "/learning-and-doing-in-public/",
                "date": "2021-04-30",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "audio",
                    "code",
                    "productivity"
                ],
                "title": "Learning (and doing) in public",
                "excerpt": "Making my upcoming to-do list public, in an effort to improve my productivity.",
                "summary": [
                    "This is similar to what you've just read because it continues the narrative of the author's goals set for the year, delving specifically into their productivity objectives tied to music and blogging, aligned with their \"Year of Writing\" theme."
                ],
                "score": 0.8354161659242657
            },
            {
                "relativePath": "2021-03-31-falling-back-in-love-with-music",
                "permalink": "/falling-back-in-love-with-music/",
                "date": "2021-03-31",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "audio"
                ],
                "title": "Falling back in love with music",
                "excerpt": "Ditching web audio in favour of hardware synthesisers",
                "summary": [
                    "This is similar to what you've just read because it dives deeper into the author's rekindled interest in music, which is an important part of the \"Year of Writing\" theme, and showcases the specific area of music the author is fascinated with: modular synthesisers."
                ],
                "score": 0.8141112081417912
            }
        ]
    },
    "2021-03-31-falling-back-in-love-with-music": {
        "relativePath": "2021-03-31-falling-back-in-love-with-music",
        "hash": "317b9f7bdd4a723610c50df68e60baead515641b05b17239e3b7385a6f75e63f",
        "summary": "After years of passion for music - which involved playing in bands, starting a record label, and running a music blog - I found myself falling out of love with it in 2013. The passion had fizzled out, and instead, I found solace in frontend engineering, creating code for the web. It's interesting to note though that even at this time, there were elements of music involved, such as in the CodePen projects I worked on and the conference talks I gave about recreating a guitarist's delay pedal in JavaScript.\n\nFast forward a few years and I gravitated towards guitar pedals - small units that worked on an audio signal. Along with the Web Audio API, this became the gateway to my new found passion - modular synthesisers. Despite my musical background being acoustically inclined, this electronic path struck a deep chord within me, thanks to a video on Andrew Huang’s YouTube channel. It became an obsession as I began collecting modules, learning about synthesising sounds and creating my own unique equipment.\n\nIn the year since I embarked on this journey, modular synthesisers have reignited my enthusiasm for music-making. Not only am I enjoying making unique sounds, but I’m also having a blast with the manipulating controls and building my own custom hardware. Being able to produce sounds physically, and \"ride\" a fader or potentiometer, beats any software experience. In addition, I find the instrument visually appealing - its spaceship control-panel vibe, the rows of potentiometers and the blinking LEDs have all added to my fascination. \n\nFollowing a \"learning in public” approach, I've been sharing my learning process on my Instagram feed while uploading completed works on my YouTube channel. The feedback and validation from these platforms are a significant encouragement. All in all, I've fallen hard for modular synthesisers, and I'm excited to see where this journey leads me.",
        "similarities": [
            {
                "relativePath": "2021-04-30-learning-and-doing-in-public",
                "permalink": "/learning-and-doing-in-public/",
                "date": "2021-04-30",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "audio",
                    "code",
                    "productivity"
                ],
                "title": "Learning (and doing) in public",
                "excerpt": "Making my upcoming to-do list public, in an effort to improve my productivity.",
                "summary": [
                    "This is similar to what you've just read because it also revolves around the author's journey with music and technology, specifically touching upon modular synthesisers, and additionally outlines the author's plan for future projects, accountability, and learning in public."
                ],
                "score": 0.8352387056368139
            },
            {
                "relativePath": "2020-12-30-web-audio-delay",
                "permalink": "/web-audio-delay/",
                "date": "2020-12-30",
                "tags": [
                    "articles",
                    "featured",
                    "intro"
                ],
                "categories": [
                    "audio",
                    "code"
                ],
                "title": "Building a delay effect with the Web Audio API",
                "excerpt": "An introduction to the power of JavaScript's Web Audio API",
                "summary": [
                    "This is similar to what you've just read because it also deals with the combination of music and coding, specifically focusing on creating an analogue sound path via JavaScript's Web Audio API, which may interest you in terms of exploring different ways of sound manipulation."
                ],
                "score": 0.8285747637244729
            }
        ]
    },
    "2021-04-30-learning-and-doing-in-public": {
        "relativePath": "2021-04-30-learning-and-doing-in-public",
        "hash": "6848bd03e7d29e5a9bba8b249d5831d6ccee5c36ecc4f9d769f28cb519c17b53",
        "summary": "The blog post highlights my decision to be publicly accountable for my planned projects as an attempt to increase productivity. It talks about my rekindled passion for music. I've chosen to learn in public: posting my experiments, practices, and pieces online for quick feedback that informs my subsequent endeavors. It requires accepting the possibility of negative feedback and modifying my understanding of when a project is \"done\". \n\nThe post shares my productivity objectives for the year which include a monthly blog piece, twelve YouTube videos on my modular synth, and fifty-two Instagram posts about the same. I also set myself some 'stretch goals' that I'd like to achieve by the end of the year. These include setting up a proper newsletter, releasing Picobel.js as a React component, and recreating Terry Riley’s _In C_ melody using the Web Audio API. I discuss the implications of failing to meet my targets, concluding that even though the consequences are minuscule, the mere possibility of failure motivates me to publish more frequently. However, the success of this approach will only be measurable in six months' time.",
        "similarities": [
            {
                "relativePath": "2021-02-07-year-of-writing",
                "permalink": "/year-of-writing/",
                "date": "2021-02-07",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "code",
                    "productivity"
                ],
                "title": "The year of writing",
                "excerpt": "Choosing my Yearly Theme for 2021.",
                "summary": [
                    "This is similar to what you've just read because it discusses the blogger's strategy to increase productivity and passion for music, focusing on setting overarching themes for the year, with an emphasis on completing projects, much like the previously shared action plan for public accountability."
                ],
                "score": 0.8354161659242657
            },
            {
                "relativePath": "2021-03-31-falling-back-in-love-with-music",
                "permalink": "/falling-back-in-love-with-music/",
                "date": "2021-03-31",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "audio"
                ],
                "title": "Falling back in love with music",
                "excerpt": "Ditching web audio in favour of hardware synthesisers",
                "summary": [
                    "This is similar to what you've just read because both posts discuss the author's passion for music and modular synthesisers, his decision to share his work online publicly in order to foster creativity, and his commitment to continuous learning and growth despite potential failures."
                ],
                "score": 0.8352387056368139
            }
        ]
    },
    "2021-07-21-line-graphs-with-react-svg-d3": {
        "relativePath": "2021-07-21-line-graphs-with-react-svg-d3",
        "hash": "eefdea8903106d08edb5dc0784de50fc0f621fd7b01b83cafcb5d26134d5592c",
        "summary": "This post delves into the process of generating dynamic SVG visualizations of audio frequency data using React and D3.js. It explains how to apply React to generate an SVG that updates when the data changes, and how to leverage various D3.js features to simplify the calculations. \n\nKey tools used in this process are SVG for drawing graph lines, React for managing graph rendering, and D3.js for processing data. The post guides you through converting an array of data into an SVG path, and handling data parsing, mapping, and component creation using React. It further demonstrates how to make the graph responsive to changing data through React's useState and useEffect hooks. \n\nOther essential points include the role of D3.js in converting data into a format understood by the SVG element's `d` property, the concept of ranges and domains in data visualization, and ways to define the spatial range of the data. Lastly, the post discusses slight differences between simplified and full-featured frequency graphs, and shares key concepts that are commonly applicable in other contexts.",
        "similarities": [
            {
                "relativePath": "2020-12-30-web-audio-delay",
                "permalink": "/web-audio-delay/",
                "date": "2020-12-30",
                "tags": [
                    "articles",
                    "featured",
                    "intro"
                ],
                "categories": [
                    "audio",
                    "code"
                ],
                "title": "Building a delay effect with the Web Audio API",
                "excerpt": "An introduction to the power of JavaScript's Web Audio API",
                "summary": [
                    "This is similar to what you've just read because it also involves creative use of JavaScript and web APIs to create interactive, dynamic, and visually engaging elements, but this time focused on audio functionality rather than data visualization."
                ],
                "score": 0.8514342898798005
            },
            {
                "relativePath": "2023-09-30-improving-svg-chart-interactivity-with-voronoi-diagrams",
                "permalink": "/improving-svg-chart-interactivity-with-voronoi-diagrams/",
                "date": "2023-09-30",
                "tags": [
                    "articles",
                    "intro"
                ],
                "categories": [
                    "code"
                ],
                "title": "Improving SVG chart interactivity with Voronoi diagrams",
                "excerpt": "How I used Delaunay triangulation and Voronoi diagrams to fix hover issues in my SVG charts (with React and D3.js).",
                "summary": [
                    "This is similar to what you've just read because it also details applications of D3.js and SVG in building interactive data visualizations, focusing on the use of Voronoi diagrams to improve the usability of scatter plots."
                ],
                "score": 0.8383405984602779
            }
        ]
    },
    "2021-09-27-podcasting-equipment": {
        "relativePath": "2021-09-27-podcasting-equipment",
        "hash": "eecc890cc1b09be0d2147c743c5ee06fb04d9c69b073e139e65a8ad3769aab52",
        "summary": "In the planning of a new podcast, I have compiled and shared some \"Podcast Equipment 101\" tips for newbies in the game. To record a decent podcast, you need a good microphone, a connection between your mic and the computer, and recording software. \n\nThe quality difference between a cheap dedicated microphone and basic methods such as earbuds is significant. Good podcasting mics include dynamic mics, condenser mics, and lavalier mics. Connections come into play when connecting your mic to the computer to record. This typically involves an XLR cable running from the mic to an audio interface that connects to the computer via USB. Some podcast-focused mics can directly connect to the computer via USB, negating the need for an audio interface.\n\nWhen it comes to software, many options exist depending upon your role in the podcast. If editing, a full Digital Audio Workstation (DAW) is necessary, but if you are only a host or guest, all you need is simple software capturing your microphone's audio. \n\nIn sum, if you are not editing, a decent USB microphone is enough, but if you want top-notch quality, an SM7B mic with requisite addons like a Cloudlifter preamp, an XLR cable, and the Scarlett Solo audio interface is the best bet. And, if you are the editor, Logic Pro is the recommended DAW to invest in. Remember that your recording technique is as important as your equipment. Always use headphones, keep the mic close to mouth, reduce noise, minimize flat reflective surfaces while recording, and control the surface directly behind the mic.\n",
        "similarities": [
            {
                "relativePath": "2020-04-28-installing-acoustic-panels",
                "permalink": "/installing-acoustic-panels/",
                "date": "2020-04-28",
                "tags": "articles",
                "categories": [
                    "podcasting",
                    "audio"
                ],
                "title": "Installing acoustic panels",
                "excerpt": "This week I installed some acoustic panels in my office to improve the sound quality of the podcast.",
                "summary": [
                    "This is similar to what you've just read because it also emphasizes the importance of quality in podcasting, with practical insight on minimizing room noise via acoustic panels to enhance recording quality, which complements the first post's detailed rundown on the appropriate microphone and recording software."
                ],
                "score": 0.8482620647094797
            },
            {
                "relativePath": "2017-05-29-podcasts-recommended-listening",
                "permalink": "/podcasts-recommended-listening/",
                "date": "2017-05-29",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "podcasting"
                ],
                "title": "Recommended Listening: my favourite podcasts",
                "excerpt": "Without any constraints of format or time, the best podcasts get to dive deep into topics that wouldn't otherwise get covered.",
                "summary": [
                    "This is similar to what you've just read because it provides recommendations on podcast shows to listen to, serving as a practical application and extension to the technical information you obtained earlier about podcast equipment and recording techniques."
                ],
                "score": 0.8344174016170013
            }
        ]
    },
    "2021-10-05-humility-in-tech": {
        "relativePath": "2021-10-05-humility-in-tech",
        "hash": "6613c69dd0a4044f111088d719b96088708086c124a499da69b24493a7187cea",
        "summary": "In this blog post, I reflect on the consciously chosen aspects of my work-personality and how the value of humility has influenced my career in tech. I explain that by embodying humility, I've created an environment that not only enhances my own learning but also promotes a positive atmosphere among colleagues. Rather than aiming to be a \"10x developer\", I aspire to elevate my team's collective work. \n\nI share experiences about how exposing my own knowledge gaps and being open to help have accelerated my understanding. Asking questions during meetings and critically yet empathetically reviewing PRs have enabled constructive dialogue and learning. Respecting \"legacy\" code and the developers behind them has saved me time and unnecessary refactoring.\n\nHowever, I acknowledge that humility might sometimes be mistaken for a lack of ideas. It's a perception game and can sometimes lead to negative first impressions and loss of opportunities. Yet, I reiterate that I know my potential and have experienced the long-term benefits of this approach. \n\nWhat's important to note is that my perspective on humility is influenced by my privilege as a straight white male with private education. I stress that my advice might not apply to everyone, especially those who have faced barriers in their careers due to systemic biases. It's for those who gain unearned respect based on these privileges that humility can be instrumental in creating a more inclusive tech environment. \n\nAs a new member of my team, my mission is to create an open environment for conversations and learning. Recognizing the importance of humility, I believe, has allowed me to flourish in my career and establish meaningful relationships, which is a win in my books.\n",
        "similarities": [
            {
                "relativePath": "2018-07-01-writing-well",
                "permalink": "/writing-well/",
                "date": "2018-07-01",
                "tags": [
                    "articles",
                    "featured"
                ],
                "categories": [
                    "code",
                    "career"
                ],
                "title": "Writing well is essential. Try your best to get good at it",
                "excerpt": "I’ve worked hard on my writing style, and continually reap the benefits of having done so.",
                "summary": [
                    "This is similar to what you've just read because it also explores how soft skills, like effective written communication, can significantly enhance your career and workplace, much like humility, by improving interactions, fostering learning, and saving time."
                ],
                "score": 0.8288687731594324
            },
            {
                "relativePath": "2014-09-09-inspirational-web-people",
                "permalink": "/inspirational-web-people/",
                "date": "2014-09-09",
                "tags": "articles",
                "categories": [
                    "career"
                ],
                "title": "Inspirational Web People",
                "excerpt": "Taking time to credit the members of the digital-community that have shaped my career is something I should do more often. Here's a few people I've found personally inspiring.",
                "summary": [
                    "\"This is similar to what you've just read because it also revolves around the theme of learning from others in the tech field, appreciating their contributions, and emphasizing the importance of humility and self-improvement in growing as a professional.\""
                ],
                "score": 0.8180720272139834
            }
        ]
    },
    "2022-02-25-wordle-node-script": {
        "relativePath": "2022-02-25-wordle-node-script",
        "hash": "babd99a6e0fb83b7cffad9c186945f6768c6e31844bf2aaf063307852ed29fea",
        "summary": "In my latest blog post, I take you on my journey to explore how command-line scripts can leverage the power of data in finding an optimal sequence of starting words while playing Wordle. While I acknowledge that the craze for this word game is almost over, I want to share how even simple scripts that are executed in your terminal can help you navigate large amounts of data efficiently, something we humans aren't particularly good at. As I didn't want to \"solve\" Wordle but merely optimize my initial guesses, I created a code to find a sequence of guesses that covers most common consonants.\n\nThe first major finding from running my script was that the most common letters in the entire Wordle dictionary were the vowels, and 'S' was the most common letter. However, since vowels are more commonly used later in the game, I focused on discovering the most common consonants.\n\nThe search for the best sequence of words revealed that not all combinations of the most common letters form valid words. Getting rid of the extra letters around the core group opened up several options. After a few trials, I found that ‘trend’ seemed the most satisfactory first word. Again, including the previous word in the ‘exc’ argument and adding new target letters to the ‘inc’ argument, I ran the script again. \n\nAfter all this fun experimentation, I learned that writing scripts need not be as daunting as it appears. In fact, it can assist you with repetitive tasks and even save you a lot of time. Yes, you might spend a few days writing a script to automate a task that could be done manually in a few hours, but who wouldn't prefer an excuse to delve into some coding fun?",
        "similarities": [
            {
                "relativePath": "2022-10-24-oblique-strategies-via-npx",
                "permalink": "/oblique-strategies-via-npx/",
                "date": "2022-10-24",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "code"
                ],
                "title": "Oblique Strategies via npx",
                "excerpt": "A node script that prints one of Brian Eno's Oblique Strategies into your terminal",
                "summary": [
                    "This is similar to what you've just read because it explores the concept of utilizing command-line scripts for unique and creative outputs, offering a different perspective on how coding projects can blend with individual interests and creativity."
                ],
                "score": 0.8017603510233204
            },
            {
                "relativePath": "2017-01-05-calculating-reading-speed",
                "permalink": "/calculating-reading-speed/",
                "date": "2017-01-05",
                "tags": "articles",
                "categories": [
                    "code"
                ],
                "title": "n-minute read: calculating an average reading speed",
                "excerpt": "I'm interested in measuring what effect, if any, displaying an approximate reading-time for articles will have on readers of my site.",
                "summary": [
                    "This is similar to what you've just read because it also discusses technical experimentation using coding/scripting, this time with the goal of calculating and displaying reading times for blog posts and checking if it influences reader engagement."
                ],
                "score": 0.797173679239104
            }
        ]
    },
    "2022-10-24-oblique-strategies-via-npx": {
        "relativePath": "2022-10-24-oblique-strategies-via-npx",
        "hash": "ce78186f0381c328abf0cc88d44ec620d6019c85d51a482f9e7b16381049a129",
        "summary": "In 1975, Brian Eno and Peter Schmidt introduced Oblique Strategies, a collection of over 100 cards, each proposing a course of action or thinking to assist in creative situations. These cards have been used by multiple artists and creative individuals around the globe. You can now get a mini taste of Oblique inspiration via your terminal by running the `npx oblique-strategy` command.\n\nThe complete code for this `npm` package is accessible on GitHub. The package itself is quite simple, with more lines dedicated to drawing the box around the output than for actually selecting the strategy. The strategies were all sourced from other GitHub repos. This exercise intended to master the `npx` process and was considered successful as valuable knowledge on `package.bin` was accumulated. The script is made freely available but the author is ready to take it down in case of complaints over rights violations. This project continues the legacy of the original idea—strategic, defined nudges guiding us towards fresh perspectives.",
        "similarities": [
            {
                "relativePath": "2022-02-25-wordle-node-script",
                "permalink": "/wordle-node-script/",
                "date": "2022-02-25",
                "tags": [
                    "articles",
                    "featured"
                ],
                "categories": [
                    "code"
                ],
                "title": "Improving my Wordle opening words using simple node scripts",
                "excerpt": "Crafting command-line scripts to calculate the most frequently used letters in Wordle (and finding an optimal sequence of starting words).",
                "summary": [
                    "This is similar to what you've just read because both blog posts detail the creation and implementation of code scripts within a terminal for creative purposes, offering returns on learning and productivity in terminal usage, and foster appreciation for tackling interesting challenges using coding."
                ],
                "score": 0.8017603510233204
            },
            {
                "relativePath": "2017-06-28-you-can-now-install-picobel-using-npm",
                "permalink": "/you-can-now-install-picobel-using-npm/",
                "date": "2017-06-28",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "audio",
                    "code"
                ],
                "title": "You can now install Picobel using NPM",
                "excerpt": "Picobel is my open source JavaScript tool for turning HTML audio tags into styleable markup.",
                "summary": [
                    "This is similar to what you've just read because it also discusses the usage of `npm` packages, focusing this time on the publication and deployment of a JavaScript tool called Picobel, offering insights into modern development workflow that complements the author's earlier delve into `npx` processes."
                ],
                "score": 0.7863050597918745
            }
        ]
    },
    "2023-06-01-client-side-search": {
        "relativePath": "2023-06-01-client-side-search",
        "hash": "2316391a83f3893cddd6861fc45a61f929c0eb477291e91fb0fc2c6bb2340153",
        "summary": "The blog post delves into the process of adding client-side search functionality to a statically-generated site. It covers the whys and hows of adding site search, the benefits it brings, and provides a deep insight into the server-side versus client-side debate. \n\nThe author explains that adding a built-in site search improves user experience by offering direct access to relevant content and eliminates the need to navigate through multiple pages. To make this happen, two principal elements are necessary: a way to create an index of the site's content and a way to query that index for relevant results. \n\nThe author compares server-side and client-side search implementations and shares their preference for the client-side. They expand on the challenges and costs associated with server-side solutions and highlight the advantages, such as the learning experience and control over the final product, when building the function on their own. \n\nThe post then describes how client-side search works in the context of a static content site. The author details the index-generation process and reveals the compatibility of JSON format for this purpose. The querying of the index, on the other hand, is executed with the \"matching\" function that provides a list of relevant results. \n\nThe blog also introduces Fuse.js, a JavaScript library effective in \"fuzzy\" searching that the author used for this project. It gives a robust overview of its features and how to implement and fine-tune it. The author closes the topic by discussing the unavoidable trade-offs and compromises in the client-side versus server-side dynamic. They're satisfied with the current search experience on the site and appreciate the learning and continuous improvement opportunities the self-built function offers.\n",
        "similarities": [
            {
                "relativePath": "2020-01-07-eleventy-static-site-generator",
                "permalink": "/eleventy-static-site-generator/",
                "date": "2020-01-07",
                "tags": [
                    "articles",
                    "featured",
                    "popular"
                ],
                "categories": [
                    "code"
                ],
                "title": "Static site generators: Hugo vs Jekyll vs Gatsby vs 11ty",
                "excerpt": "I have an obsession with SSGs, and Eleventy is my favourite (even better than Hugo, Jekyll, and Gatsby).",
                "summary": [
                    "\"This is similar to what you've just read because it continues the exploration of client-side operations and website optimization, this time focusing on the use of static site generators, tools that could further enhance the experience when setting up search functionality on a static site.\""
                ],
                "score": 0.8008626057739316
            },
            {
                "relativePath": "2021-01-17-adding-rss",
                "permalink": "/adding-rss/",
                "date": "2021-01-17",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "code"
                ],
                "title": "RSS in 2021 (yes, it's still a thing)",
                "excerpt": "Adding an RSS feed to an Eleventy site is (mostly) easy peasy.",
                "summary": [
                    "This is similar to what you've just read because it delves into another aspect of improving user experience on a static content site, discussing the implementation of RSS feeds for seamless content delivery, much like the first post talked about enhancing user experience with client-side search functionality."
                ],
                "score": 0.7918425619613471
            }
        ]
    },
    "2023-08-31-what-if-minesweeper-kept-getting-harder": {
        "relativePath": "2023-08-31-what-if-minesweeper-kept-getting-harder",
        "hash": "fefa9660afad436d13de21fbe4eaf00dd75f10c2e9270d60ccdd4b1822d4c2af",
        "summary": "I dove into the world of game development with a twist on the classic Minesweeper. Over the years, I used to raise the stakes by adding an extra mine each time I completed a grid. This sparked the idea to automate this process and incrementally increase the difficulty level as progress is made. [Try out my version here](https://incremental-minesweeper.netlify.app/). \n\nFor those who aren't familiar, Minesweeper involves clicking cells on a grid to reveal their contents. The catch is, if you reveal a cell containing a mine, you lose. Using logic and clues from numbers displayed on the grid, you have to clear all the cells that don't encase a mine to win. My version differs from the classic game mainly by its difficulty progression. Every time you complete a grid, a mine is added, turning your score into a ticking time bomb. I've also constrained things to a 10 x 10 grid for mobile-friendliness and ensured that the first click will always land on a clear cell to avoid frustrating instant losses. After much nudging from early playtesters, flagging or marking also made its way into the game. \n\nI've managed to score a high of 36 after tinkering around for about a year. Can you beat that? Go ahead, take your shot, and show me your best on [Mastodon](https://mastodon.social/@tomhazledine).",
        "similarities": [
            {
                "relativePath": "2022-02-25-wordle-node-script",
                "permalink": "/wordle-node-script/",
                "date": "2022-02-25",
                "tags": [
                    "articles",
                    "featured"
                ],
                "categories": [
                    "code"
                ],
                "title": "Improving my Wordle opening words using simple node scripts",
                "excerpt": "Crafting command-line scripts to calculate the most frequently used letters in Wordle (and finding an optimal sequence of starting words).",
                "summary": [
                    "This is similar to what you've just read because, like the Minesweeper post, it explores using coding and data analysis to optimize gameplay and enhance player experience, this time with the popular word game, Wordle."
                ],
                "score": 0.7837641217986089
            },
            {
                "relativePath": "2017-01-20-bullet-journal-revisited",
                "permalink": "/bullet-journal-revisited/",
                "date": "2017-01-20",
                "tags": [
                    "articles",
                    "popular"
                ],
                "categories": [
                    "general",
                    "productivity"
                ],
                "title": "Bullet Journal Revisited",
                "excerpt": "The Bullet Journal is a system for Getting Things Done. One nested pen-and-paper list that gets rewritten every morning.",
                "summary": [
                    "This is similar to what you've just read because it discusses the development and fine-tuning of a system - in this case, a productivity tool - based on feedback and personal preferences, much like how the author adjusted the rules and features of the Minesweeper game in the first post."
                ],
                "score": 0.7628795255605386
            }
        ]
    },
    "2023-09-30-improving-svg-chart-interactivity-with-voronoi-diagrams": {
        "relativePath": "2023-09-30-improving-svg-chart-interactivity-with-voronoi-diagrams",
        "hash": "0b0be610098c1136570861f0efae259247e6d71c3c819c10bb5a381e7250ff5d",
        "summary": "The blog post is about improving the interactivity of SVG charts, especially scatter plots, using voronoi diagrams. The writer shares his experience with hover-triggered tooltips, especially their usability problem owing to the precision required to target points. To overcome this, the writer proposes increasing the size of the points but notes that this solution interferes with the design of the plot.\n\nThe author then shares his solution of adding a 'hitbox' or buffer area around each point. This allows for larger targets without sacrificing the visual quality of the plot. He demonstrates how this can be achieved on a scatter plot using SVG's 'group' tag to replace a single data point with two circles. However, he also notes a potential problem - overlapping hitboxes, which can cause issues when there are a lot of points on the graph.\n\nThe writer then introduces the main part of the blog - using Voronoi diagrams, which split the chart area into cells assigned to each data point, creating a large hitbox without overlaps. He explains the concepts and demonstrates how to employ a Voronoi diagram using D3.js, a JavaScript library for creating data visualizations in SVG. He outlines the steps involved, from creating a Delaunay triangulation object to converting this into a Voronoi diagram.\n\nThe writer finishes with some practical tips for applying this technique, including using event listeners to enhance the interactivity of the chart by highlighting active points or displaying tooltips. He asserts that this way can greatly enhance SVG chart interactivity and it requires only a few extra lines of code when using D3.js. He says if already familiar with attaching event listeners and toggling class names based on the state, readers should be able to get up to speed easily with Voronoi diagrams.",
        "similarities": [
            {
                "relativePath": "2021-07-21-line-graphs-with-react-svg-d3",
                "permalink": "/line-graphs-with-react-svg-d3/",
                "date": "2021-07-21",
                "tags": [
                    "articles",
                    "featured",
                    "intro"
                ],
                "categories": [
                    "audio",
                    "code"
                ],
                "title": "Line graphs with React and D3.js",
                "excerpt": "Generating a dynamic SVG visualisation of audio frequency data.",
                "summary": [
                    "This is similar to what you've just read because it expands on the use of SVG and D3.js for data visualization, this time incorporating React and focusing on how to create a dynamic line graph, which resonates with the theme of enhancing interactivity covered in the first post."
                ],
                "score": 0.8383405984602779
            },
            {
                "relativePath": "2017-02-15-svg-markup",
                "permalink": "/svg-markup/",
                "date": "2017-02-15",
                "tags": [
                    "articles",
                    "popular"
                ],
                "categories": [
                    "code"
                ],
                "title": "Getting to grips with SVG markup",
                "excerpt": "SVGs are complex, for sure, but that very complexity gives them their power. And we don't need to know the intricacies of the co-ordinate system to harness that power.",
                "summary": [
                    "This is similar to what you've just read because it also focuses on SVGs, but takes a broader look at their potential advantages and how their simple language and compatibility with CSS can enable developers to creatively enhance their designs."
                ],
                "score": 0.797112384961181
            }
        ]
    },
    "2015-12-03-thingmonk-day-one": {
        "relativePath": "2015-12-03-thingmonk-day-one",
        "hash": "89db0f0c1b85261270ca27a647477dd977a5f2b12778b7054c418490b8bcc705",
        "summary": "The blog post delves into the first day of the ThingMonk conference, an event for developers, designers, and decision-makers, focusing on turning ideas into industrial scale systems. High-profile speaker and Ubuntu professional, Mark Shuttleworth, set the stage with an interesting exposition on scale, not in the form of giant, costly mega-computers, but as a network of cheap, tiny micro-computers. His emphasis on the imminent significance of IoT and data responsibility made an impact.\n\nUser experience expert, Claire Rowland, shared her insights on managing UX in the world of connected things, underlining the difference in expectation between internet interfaces and interconnected objects. The post also highlights the \"Seven Deadly Sins for Design of IoT\" presented by IBM's Sam Winslet and Sophie Riches. From managing user expectation and avoiding 'feature gluttony' to making sure to cater to user patience, they detailed common errors in IoT design.\n\nThe discussion on security challenges and advancements in printing NFC chips into business cards by Moo's Nick Ludlum garnered interest. Moving onto network and data handling, Dave McCrory explored the concept of 'data gravity' and the nuances of handling real-time analytics. Among other notable aspects, the blog also shares Yodit Stanton's unexpected hurdles in dealing with connected buildings and Boris Adryan's dissection of IoT's future. The first day was drawn to a close with a promising discussion on IoT devices and conversation as a solution to their main issues.\n",
        "similarities": [
            {
                "relativePath": "2015-12-04-thingmonk-day-two",
                "permalink": "/thingmonk-day-two/",
                "date": "2015-12-04",
                "tags": "articles",
                "categories": [
                    "events"
                ],
                "title": "Notes from ThingMonk: Day Two",
                "excerpt": "The second installment of my notes from the ThinkMonk IoT conference.",
                "summary": [
                    "\"This is similar to what you've just read because it continues the discussion from the ThingMonk IoT conference, providing more insights on IoT concepts, security, data analytics, and its significance in various industries from other expert speakers.\""
                ],
                "score": 0.9431052355240525
            },
            {
                "relativePath": "2017-01-20-bullet-journal-revisited",
                "permalink": "/bullet-journal-revisited/",
                "date": "2017-01-20",
                "tags": [
                    "articles",
                    "popular"
                ],
                "categories": [
                    "general",
                    "productivity"
                ],
                "title": "Bullet Journal Revisited",
                "excerpt": "The Bullet Journal is a system for Getting Things Done. One nested pen-and-paper list that gets rewritten every morning.",
                "summary": [
                    "This is similar to what you've just read because it provides another perspective on managing tasks and achieving goals at a systematic level, which could resonate with readers interested in efficient systems for handling complex projects, as discussed in the ThingMonk conference."
                ],
                "score": 0.8164868306567772
            }
        ]
    },
    "2023-10-27-llm-related-posts": {
        "relativePath": "2023-10-27-llm-related-posts",
        "hash": "ed3a55adf3bd36914557ebe6606c9424a3141ad25e913cd2cf6c1290b482d99c",
        "summary": "The post delves into the author's exploration of using embeddings and even GPT4 for generating related posts for the blog. The power of embeddings is underscored - they serve as an excellent tool for natural language search, comparing and measuring how similar two texts are. This approach enables the blog to sidestep complicated algorithms and matching engines. \n\nA detailed guide is presented, from reading all markdown files, via generating an embedding for the whole post, to creating a summary for each post and comparing the posts based on the cosine similarity of the embedding vectors. The script, which requires markdown files of blog posts, results in a more efficient generation of related posts for blogs. \n\nPitfalls were encountered along the way, such as rate limits, token limits, pricing, inconsistent output, hallucination, and deletion - though these issues were overcome after weeks of experimentation. The post concludes with suggestions for optimizing the script, including featuring caching and hashing patterns to save on time and cost while skipping unchanged posts. The end result is a well-implemented related posts sections at the bottom of the blog's page. The author concludes by expressing willingness to make the script generic and open-source based on demand.",
        "similarities": [
            {
                "relativePath": "2021-01-17-adding-rss",
                "permalink": "/adding-rss/",
                "date": "2021-01-17",
                "tags": [
                    "articles"
                ],
                "categories": [
                    "code"
                ],
                "title": "RSS in 2021 (yes, it's still a thing)",
                "excerpt": "Adding an RSS feed to an Eleventy site is (mostly) easy peasy.",
                "summary": [
                    "This is similar to what you've just read because it also deals with the topic of automated blog content distribution, specifically diving into the process of integrating an RSS feed, a channel which - like the LLM-based automatic posting from the first post - also bypasses algorithmic interferences."
                ],
                "score": 0.7949880662192309
            },
            {
                "relativePath": "2022-02-25-wordle-node-script",
                "permalink": "/wordle-node-script/",
                "date": "2022-02-25",
                "tags": [
                    "articles",
                    "featured"
                ],
                "categories": [
                    "code"
                ],
                "title": "Improving my Wordle opening words using simple node scripts",
                "excerpt": "Crafting command-line scripts to calculate the most frequently used letters in Wordle (and finding an optimal sequence of starting words).",
                "summary": [
                    "This is similar to what you've just read because it delves into another practical application of scripting and data manipulation, this time focusing on a word game, which could interest readers who enjoy seeing real-world implications of coding and automated processes."
                ],
                "score": 0.7938704968029567
            }
        ]
    }
}